[
    {
        "title": "Mufasa: The Lion King",
        "poster": "https://image.tmdb.org/t/p/original/jbOSUAWMGzGL1L4EaUF8K6zYFo7.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/cVh8Af7a9JMOJl75ML3Dg2QVEuq.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/1w8kutrRucTd3wlYyu5QlUDMiG1.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/bQFYVhFnshXIQHmMKDX3FsP77tP.png",
        "main_src": "https://hdstream4u.com/embed/z79o0gekbt0w",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/arxGBPMmsFU",
        "genre": [
            "Animation",
            "Adventure",
            "Drama",
            "Fantasy",
            "Musical",
            "Family"
        ],
        "key_words": [
            "Mufasa The Lion King",
            "2024"
        ],
        "description": "Mufasa: The Lion King is a 2024 American musical drama film directed by Barry Jenkins. Serving as both a prequel and sequel to the 2019 adaptation of The Lion King, the film explores the origins of Mufasa, Simba's father. The narrative unfolds through flashbacks as Rafiki recounts Mufasa's journey from an orphaned cub to becoming the king, highlighting his relationship with Taka, who later becomes Scar. The film features a notable voice cast, including Aaron Pierre as Mufasa, Kelvin Harrison Jr. as Taka, and returning talents such as Seth Rogen and Billy Eichner. Upon its release on December 20, 2024, Mufasa: The Lion King received mixed reviews from critics and has grossed $717 million worldwide, making it the sixth-highest-grossing film of 2024. The film is scheduled for digital download release on February 18, 2025, with a Disney+ streaming release on March 26, 2025, and availability on 4K Ultra HD, Blu-ray, and DVD on April 1, 2025."
    },
    {
        "title": "Moana 2",
        "poster": "https://image.tmdb.org/t/p/original/720TEIkvYHUYHg1N7ShUxZmh0gu.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/vYqt6kb4lcF8wwqsMMaULkP9OEn.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/z6H78tQNcryTO4sgDjg8Knc6H9W.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/9BXuuOa8b9AX5NalFg5LEzPqrq0.png",
        "main_src": "https://Smoothpre.com/embed/web41b495ju6",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/hDZ7y8RP5HE",
        "genre": [
            "Animation",
            "Adventure",
            "Musical",
            "Comedy"
        ],
        "key_words": [
            "Moana",
            "2024"
        ],
        "description": "Moana 2, the sequel to Disney's 2016 animated classic, continues the adventurous journey of Moana (voiced by Auli'i Cravalho), now a celebrated wayfinder.\n\nThe film opens with Moana exploring nearby islands, seeking connections with other oceanic tribes. She experiences a vision from her ancestor, Tautai Vasa, revealing that the storm god Nalo submerged the legendary island of Motufetu, disrupting the unity among the islands.\n\nTautai warns that without restoring Motufetu, Moana's home island of Motunui faces a desolate future.\n\nDetermined to save her people, Moana assembles a diverse crew: the craftswoman Loto, historian Moni, the grumpy elder Keke, and her loyal pets, Pua the pig and Heihei the rooster. They embark on a daring voyage across the ocean, guided by a comet's path toward the hidden Motufetu. Along the way, they encounter the Kakamora, once-hostile coconut-like pirates, who reveal that Nalo's actions severed their connection to their homeland. Forming an alliance, they confront various challenges, including a gargantuan monster clam.\n\nMeanwhile, the demigod Maui (voiced by Dwayne Johnson) seeks Motufetu but is captured by Nalo's enforcer, Matangi. Despite initial reluctance to involve Moana, fearing for her safety, Maui eventually reunites with her and the crew. Together, they face Nalo's monstrous creations and a formidable storm guarding Motufetu. In a climactic battle, Maui attempts to raise the sunken island but loses his powers to Nalo. Demonstrating immense courage, Moana dives into the ocean to break the curse, succeeding but seemingly sacrificing herself. Her ancestors intervene, reviving her as a demigoddess, symbolized by new tattoos marking her ascension.\n\nWith renewed strength, Moana and Maui restore Motufetu, reuniting the scattered tribes and bringing harmony back to the oceanic world. The film concludes with a celebratory return to Motunui, where Moana's leadership and bravery are honored. A mid-credits scene hints at future adventures, as Nalo vows revenge, setting the stage for potential sequels.\n\nMoana 2 explores themes of unity, heritage, and resilience, blending Polynesian folklore with vibrant animation and musical sequences. While some critics feel it doesn't fully capture the original's magic, it offers an entertaining experience for audiences, particularly younger viewers."
    },
    {
        "title": "The Platform",
        "poster": "https://image.tmdb.org/t/p/original/iXvQnzy6JCAx1PiQEKXuTY04ZHl.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/2bthpeVFKRtZpmVmXdvVLFQN6xt.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/3tkDMNfM2YuIAJlvGO6rfIzAnfG.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/4sV39gAfXreETlzz6SBOO0ouQEV.png",
        "main_src": "https://vidlink.pro/movie/619264",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/RlfooqeZcdY",
        "genre": [
            "Dystopian Sci-Fi",
            "Prison Drama",
            "Horror",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "The Platform",
            "2019"
        ],
        "description": "A mysterious place, an indescribable prison, a deep hole. An unknown number of levels. Two inmates living on each level. A descending platform containing food for all of them. An inhuman fight for survival, but also an opportunity for solidarity."
    },
    {
        "title": "The Dictator",
        "poster": "https://image.tmdb.org/t/p/original/yWEk2t1phuavJpGdc4XvPqcC7a4.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/jWq20KNbg5txb28tLxJl0yLYuxp.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/wDx8lSt6JpLfQ9uFQ7I9cHpluIs.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/21JyTVacPL2QcZlw9RWquQpbTEG.png",
        "main_src": "https://vidlink.pro/movie/76493",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/cYplvwBvGA4",
        "genre": [
            "Satire",
            "Comedy"
        ],
        "key_words": [
            "The Dictator",
            "2012"
        ],
        "description": "The Republic of Wadiya is ruled by an eccentric and oppressive leader named Hafez Aladeen. Aladeen is summoned to New York to a UN assembly to address concerns about his country's nuclear weapons program, but the trip goes awry"
    },
    {
        "title": "Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
        "poster": "https://image.tmdb.org/t/p/original/kfkyALfD4G1mlBJI1lOt2QCra4i.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kt0Ku4cTQUZe4KyZiWC6HsWCbcS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/jJYOr36wS1B6EyGjLY17r9kNHHh.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/e3JAH1hVPDG2CRx6NqB6n0HLYs2.png",
        "main_src": "https://vidlink.pro/movie/496",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/vlnUa_dNsRQ",
        "genre": [
            "Dark Comedy",
            "Mockumentary",
            "Satire",
            "Comedy"
        ],
        "key_words": [
            "Borat Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
            "Borat! Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
            "2006"
        ],
        "description": "Borat Sagdiyev is a TV reporter of a popular show in Kazakhstan as Kazakhstan's sixth most famous man and a leading journalist. He is sent from his home to America by his government to make a documentary about American society and culture. Borat takes a course in New York City to understand American humor. While watching Baywatch on TV, Borat discovers how beautiful their women are in the form of C. J. Parker, who was played by actress Pamela Anderson who hails from Malibu, California. He decides to go on a cross-country road trip to California in a quest to make her his wife and take her back to his country. On his journey Borat and his producer encounter a country full of strange and wonderful Americans, real people in real chaotic situations with hysterical consequences."
    },
    {
        "title": "Borat Subsequent Moviefilm: Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan",
        "poster": "https://image.tmdb.org/t/p/original/3L1Ml5RWjFVfVq3rQENvgFymT0U.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hbrXbVoE0NuA1ORoSGGYNASagrl.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/ji7m2g3xYw2B3Z1IqTNQSldRlzT.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/coWH4YdTsk2Xouw7N0qghyOawcJ.png",
        "main_src": "https://vidsrc.in/movie/740985",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/0Rsa4U8mqkw",
        "genre": [
            "Farce",
            "Mockumentary",
            "Parody",
            "Satire",
            "Comedy"
        ],
        "key_words": [
            "Borat Subsequent Moviefilm Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan",
            "Borat Subsequent Moviefilm! Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan",
            "2020"
        ],
        "description": "Borat Subsequent Moviefilm: Delivery of Prodigious Bride to American Regime for Make Benefit Once Glorious Nation of Kazakhstan (2020) is a sequel to the cultural phenomenon that was the first film, Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006). I think it's safe to say most of us never expected this movie to happen, let alone be secretly filmed and release just a couple of months after its announcement. I also think it is safe to assume that most of us didn't think a sequel would be as good as the original. It would just be impossible to recapture the shocking satirical mockumentary that was the first one, but it's almost as shocking a sequel would be made today with all the political correctness, cancel culture, etc. that has become so prevalent in today's media. While this movie is definitely not as good as the original and some of its charm is lost since it has been already done before, and replicated, it still remains hilarious yet important."
    },
    {
        "title": "Anora",
        "poster": "https://image.tmdb.org/t/p/original/21qUerwfWNTwbGKc2ZH5rXXAnwm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kEYWal656zP5Q2Tohm91aw6orlT.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/qvyOfwTC3qdbzkqdXWSSEMHtjBZ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/e4zNwk1MWsmND5DIBvfzXEUnEjP.png",
        "main_src": "https://vidlink.pro/movie/1064213",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/8m6UrWMl18M",
        "genre": [
            "Dark Comedy",
            "Raunchy Comedy",
            "Romantic Comedy",
            "Steamy Romance",
            "Comedy",
            "Drama",
            "Romance"
        ],
        "key_words": [
            "Anora",
            "2024"
        ],
        "description": "Anora, a young sex worker from Brooklyn, gets her chance at a Cinderella story when she meets and impulsively marries the son of an oligarch. Once the news reaches Russia, her fairytale is threatened as the parents set out for New York to get the marriage annulled."
    },
    {
        "title": "Captain America: Brave New World",
        "poster": "https://image.tmdb.org/t/p/original/pzIddUEMWhWzfvLI3TwxUG2wGoi.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/ywe9S1cOyIhR5yWzK7511NuQ2YX.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/qfAfE5auxsuxhxPpnETRAyTP5ff.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/fayntTIz513LPVVckksjlp4KOoX.png",
        "main_src": "https://vidlink.pro/movie/822119",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/5PSzFLV-EyQ",
        "genre": [
            "Action Epic",
            "Adventure Epic",
            "Sci-Fi Epic",
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Captain America Brave New World",
            "Captain America 4",
            "2025"
        ],
        "description": "Some time after the events of The Falcon and the Winter Soldier, Sam Wilson has now fully embraced his title as the new Captain America. Now Sam is summoned to the White House as the new president Ross wants to work with him on rebuilding the Avengers. But trouble ensues when Sam's friend Isaiah Bradley uncontrollably tries to assassinate the president and is framed for the attempt. Now Sam and his partner Joaquin Torres must race against time to uncover the true culprit and foil an evil plot that unwittingly involves President Ross"
    },
    {
        "title": "The Shawshank Redemption",
        "poster": "https://image.tmdb.org/t/p/original/9cqNxx0GxF0bflZmeSMuL5tnGzr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/zfbjgQE1uSd9wiPTX4VzsLi0rGG.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gZMgEUYbh0DIBNaRJT0ofxLDJ5T.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/8pPq3gJG4oWYonbL6DaHslJeCaM.png",
        "main_src": "https://vidlink.pro/movie/278",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/PLl99DlL6b4",
        "genre": [
            "Epic",
            "Period Drama",
            "Prison Drama",
            "Drama"
        ],
        "key_words": [
            "The Shawshank Redemption",
            "1994"
        ],
        "description": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red"
    },
    {
        "title": "The Godfather",
        "poster": "https://image.tmdb.org/t/p/original/3Tf8vXykYhzHdT0BtsYTp570JGQ.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/tmU7GeKVybMWFButWEGl2M4GeiP.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/90UI4bE5aSOWBf6Awf3pYjAxcva.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/f6YA8R8pd1Vd8dqZamBlDnWsIfS.svg",
        "main_src": "https://vidlink.pro/movie/238",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Ew9ngL1GZvs",
        "genre": [
            "Epic",
            "Gangster",
            "Tragedy",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "The Godfather",
            "1972"
        ],
        "description": "The Godfather 'Don' Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WWII Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart."
    },
    {
        "title": "The Dark Knight",
        "poster": "https://image.tmdb.org/t/p/original/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/dqK9Hag1054tghRQSqLSfrkvQnA.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/6qYxCxggmaUy6C9SaDOq0fVym6S.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/nKJFT72I3uR0TCNFh6TksDvf3Ix.svg",
        "main_src": "https://vidlink.pro/movie/155",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/_PZpmTj1Q8Q",
        "genre": [
            "Action Epic",
            "Epic",
            "Superhero",
            "Tragedy",
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "key_words": [
            "The Dark Knight",
            "2008"
        ],
        "description": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as 'The Joker' appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to 'confront everything he believes' and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes"
    },
    {
        "title": "The Godfather Part II",
        "poster": "https://image.tmdb.org/t/p/original/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/poec6RqOKY9iSiIUmfyfPfiLtvB.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/gEfwCTLbcX7jvIHLTXfVW1idZby.png",
        "main_src": "https://vidlink.pro/movie/240",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/7pfqivkYUlE",
        "genre": [
            "Epic",
            "Gangster",
            "Tragedy",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "The Godfather Part II",
            "1974"
        ],
        "description": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba"
    },
    {
        "title": "12 Angry Men",
        "poster": "https://image.tmdb.org/t/p/original/ppd84D2i9W8jXmsyInGyihiSyqz.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/w4bTBXcqXc2TUyS5Fc4h67uWbPn.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/tj6iPnz18hGfr0LKqWmG6Cp3niO.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/uvXtPqfDAFEyxKCh06y0uiofK4T.png",
        "main_src": "https://vidlink.pro/movie/389",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/TEN-2uTi2c0",
        "genre": [
            "Legal Drama",
            "Psychological Drama",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "12 Angry Men",
            "1957"
        ],
        "description": "The defense and the prosecution have rested, and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, AND each other. Based on the play, all of the action takes place on the stage of the jury room"
    },
    {
        "title": "The Lord of the Rings: The Return of the King",
        "poster": "https://image.tmdb.org/t/p/original/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/5JrZAtyk3LwiiAWLW0kwz41XZJC.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/2glQ9nYxjCRB27mpwNjS4pfH0RK.svg",
        "main_src": "https://vidlink.pro/movie/122",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/zckJCxYxn1g",
        "genre": [
            "Action Epic",
            "Adventure Epic",
            "Epic",
            "Fantasy Epic",
            "Mountain Adventure",
            "Quest",
            "Sword & Sorcery",
            "Tragedy",
            "Adventure",
            "Drama"
        ],
        "key_words": [
            "The Lord of the Rings: The Return of the King",
            "The Lord of the Rings The Return of the King",
            "2003"
        ],
        "description": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith."
    },
    {
        "title": "Schindler's List",
        "poster": "https://image.tmdb.org/t/p/original/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/zb6fM1CX41D9rF9hdgclu0peUmy.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/3akIPnq3IYaUVy0ZgYEETR0WmBm.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/vYKiCkByWJWGVL7beyQhnvzepLG.svg",
        "main_src": "https://vidlink.pro/movie/424",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/mxphAlJID9U",
        "genre": [
            "Docudrama",
            "Epic",
            "Historical Epic",
            "Period Drama",
            "Prison Drama",
            "Tragedy",
            "Biography",
            "Drama",
            "History"
        ],
        "key_words": [
            "Schindler's List",
            "1993"
        ],
        "description": "Oskar Schindler is a vain and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us."
    },
    {
        "title": "Pulp Fiction",
        "poster": "https://image.tmdb.org/t/p/original/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/52StM7zDmcjeKxWkW55X5LtoLQi.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/96hiUXEuYsu4tcnvlaY8tEMFM0m.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/dqgrq8H3ky4MxWdXyKKk8hK5E5u.png",
        "main_src": "https://vidlink.pro/movie/680",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/tGpTpVyI_OQ",
        "genre": [
            "Dark Comedy",
            "Drug Crime",
            "Gangster",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "Pulp Fiction",
            "1994"
        ],
        "description": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hitmen who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents."
    },
    {
        "title": "The Lord of the Rings: The Fellowship of the Ring",
        "poster": "https://image.tmdb.org/t/p/original/5m0zjctrxy9HeSAtnGWNLlsnr8z.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/x2RS3uTcsJJ9IfjNPcgDmukoEcQ.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/zzIdXP769uYxQq6rK9plfeoVdTo.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/26zlLzgXrdzxKx3eD0gl36sh9fg.png",
        "main_src": "https://vidlink.pro/movie/120",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/CbYmZOV3G-Q",
        "genre": [
            "Action Epic",
            "Adventure Epic",
            "Dark Fantasy",
            "Epic",
            "Fantasy Epic",
            "Quest",
            "Sword & Sorcery",
            "Adventure",
            "Drama",
            "Fantasy"
        ],
        "key_words": [
            "The Lord of the Rings: The Fellowship of the Ring",
            "The Lord of the Rings The Fellowship of the Ring",
            "2001"
        ],
        "description": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to Mount Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign"
    },
    {
        "title": "The Good, the Bad and the Ugly",
        "poster": "https://image.tmdb.org/t/p/original/bX2xnavhMYjWDoZp1VM6VnU1xwe.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/x4biAVdPVCghBlsVIzB6NmbghIz.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/eoCSp75lxatmIa6aGqfnzwtbttd.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/lsWpgoZ5SUfmcssShExi4F1mr9Y.png",
        "main_src": "https://vidlink.pro/movie/429",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/IFNUGzCOQoI",
        "genre": [
            "Adventure Epic",
            "Dark Comedy",
            "Desert Adventure",
            "Epic",
            "Period Drama",
            "Quest",
            "Spaghetti Western",
            "Western Epic",
            "Adventure",
            "Western"
        ],
        "key_words": [
            "The Good, the Bad and the Ugly",
            "The Good the Bad and the Ugly",
            "Il buono, il brutto, il cattivo",
            "Il buono il brutto il cattivo",
            "1966"
        ],
        "description": "During the American Civil War, three men set off to find $200,000.00 in buried gold coins. Tuco and Blondie have known each other for some time, having used the reward on Tuco's head as a way of earning money. They come across a dying man, Bill Carson, who tells them of a treasure in gold coins. By chance, he reveals the name of the cemetery and the name of the grave where the gold is buried. Now rivals, the two men have good reason to keep each other alive. The third man, Angel Eyes, hears of the gold stash from someone he's been hired to kill. All he knows is to look for someone named Bill Carson. The three ultimately meet in a showdown that takes place amid a major battle between Confederate and Union forces"
    },
    {
        "title": "Girls Will Be Girls",
        "poster": "https://image.tmdb.org/t/p/original/psklilaTgyczbHidamDlpFWodb0.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/6YO8KUBFuH2fReUrAFmASoqQPjj.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/2OaiuqtBygADbqiUQmqq1c1S2gg.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/3tltAXiPm6J7lZd7k0y16zZkWke.png",
        "main_src": "https://vidlink.pro/movie/1108828",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/cJqnhaBZtfs",
        "genre": [
            "Coming-of-Age",
            "Drama",
            "Romance"
        ],
        "key_words": [
            "Girls Will Be Girls",
            "2024"
        ],
        "description": "Mira is the senior school student and has plenty of stuff going on in her life. She has to concentrate on her studies to get good grades, balance her relationship with her strict mother, cope with personal problems of adolescence and deal with her attraction to a boy student."
    },
    {
        "title": "Frankenstein",
        "poster": "https://image.tmdb.org/t/p/original/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hZ9f2corJKDz0mp1RD6E7zBOsa0.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/8FHmMH4mTkSTypqI70lxY14da2c.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/tH8KX7cJRriyFsWZkVZwPieU0A8.png",
        "main_src": "https://vidlink.pro/movie/3035",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/ctoOmIWr2vg",
        "genre": [
            "Body Horror",
            "Monster Horror",
            "Tragedy",
            "Drama",
            "Horror",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "Frankenstein 1931",
            "Frankenstein",
            "1931"
        ],
        "description": "The 1931 horror movie 'Frankenstein', tells the tale of when Henry Frankenstein who is a doctor, trying to discover a way to make a living human using human body parts from the recently deceased. He succeeds, but his creation is looked upon as a monster by the local inhabitants, who wish to destroy it."
    },
    {
        "title": "Captain America",
        "poster": "https://image.tmdb.org/t/p/original/nBRcChS66NohR3x6KVYMp6Obutt.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hKVwvPUwMXcVqTJXOkPXUTQ7GMU.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/hKVwvPUwMXcVqTJXOkPXUTQ7GMU.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/uGcDdDazrNqZVu3EgQTnSyir1KI.png",
        "main_src": "https://vidlink.pro/movie/106355",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Q7GtCsXn1yE",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "Captain America 1944",
            "Captain America",
            "1944"
        ],
        "description": "Superhero Captain America battles the evil forces of the archvillain called The Scarab, who poisons his enemies and steals a secret device capable of destroying buildings by sound vibrations."
    },
    {
        "title": "Red Sonja",
        "poster": "https://image.tmdb.org/t/p/original/qYJFrmSjy0HpzmvnIuGpuFUzXbs.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/iWFnany1vDQ4EoBgvm7E3Pb0RyS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/AcjyuOHcS4LUn9RhIUGivuWgWjF.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/kQOfuMQq6jq6SA3blWZYwgX9ooP.png",
        "main_src": "https://vidlink.pro/movie/9626",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/LWfEL_zAA78",
        "genre": [
            "Sword & Sorcery",
            "Action",
            "Adventure",
            "Fantasy"
        ],
        "key_words": [
            "Red Sonja",
            "Red Sonja 1985",
            "1985"
        ],
        "description": "The tyrant Gedren seeks the total power in a world of barbarism. She attacks and kills the keepers of a powerful talisman just before it is destroyed. Gedren then uses the power of the talisman in her raid of the city Hablac. Red Sonja, sister of the keeper, sets out with her magic sword to overthrow Gedren. The talisman's master Kalidor follows to protect her. Of course they fall in love - however Red Sonja's power bases on the oath to never give herself to any man..."
    },
    {
        "title": "Howard the Duck",
        "poster": "https://image.tmdb.org/t/p/original/eU0dWo8PJgsSAZFbcyHiUpuLSyW.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/3KQe8Vzma7ZAYE25mJjgIG4Gj5e.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/a60QDTbISwyMWauftHmCLiN7GLc.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/5AM4R0tEecwGnC527CpQtxNGGvo.png",
        "main_src": "https://vidlink.pro/movie/10658",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/ll6HwvEiVK4",
        "genre": [
            "Alien Invasion",
            "Dark Comedy",
            "Superhero",
            "Action",
            "Adventure",
            "Comedy",
            "Romance",
            "Sci-Fi"
        ],
        "key_words": [
            "Howard the Duck 1986",
            "Howard the Duck",
            "1986"
        ],
        "description": "A scientific experiment unknowingly brings extraterrestrial life forms to the Earth through a laser beam. First is the cigar smoking drake Howard from the duck's planet. A few kids try to keep him from the greedy scientists and help him back to his planet. But then a much less friendly being arrives through the beam..."
    },
    {
        "title": "Men in Black",
        "poster": "https://image.tmdb.org/t/p/original/uLOmOF5IzWoyrgIF5MfUnh5pa1X.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/1GJvBE7UWU1WOVi0XREl4JQc7f8.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/kMHtwjPa9bFqqbTL1HFEt8kdlnL.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/47QgpHR9fWmCJLL7BHccTBPckeL.png",
        "main_src": "https://vidlink.pro/movie/607",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/HYUd7AOw_lk",
        "genre": [
            "Alien Invasion",
            "Buddy Comedy",
            "Buddy Cop",
            "High-Concept Comedy",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Comedy",
            "Sci-Fi"
        ],
        "key_words": [
            "Men in Black 1997",
            "Men in Black",
            "1997",
            "MIB"
        ],
        "description": "Based off of the comic book. Unbeknownst to other people, there is a private agency code named MiB. This agency is some kind of extra terrestrial surveillance corporation. Then, one of the agency's finest men only going by the name 'K' (Tommy Lee Jones) , is recruiting for a new addition to the agency. He has chosen James Edwards (Will Smith) of the N.Y.P.D. Then, one day, a flying saucer crashes into Earth. This was an alien a part of the 'Bug' race. He takes the body of a farmer (Vincent D'Onofrio) and heads to New York. He is searching for a super energy source called 'The Galaxy'. Now, Agents J and K must stop the bug before it can escape with the galaxy."
    },
    {
        "title": "Blade",
        "poster": "https://image.tmdb.org/t/p/original/oWT70TvbsmQaqyphCZpsnQR7R32.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hZnnUq0mrUQ3e54SJVca4mf2oAQ.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/bMhkCnATDPztcxFJULfnBqvzkyd.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/mOJ0ZFPzI2R4fku6HKZcuKA0RM0.png",
        "main_src": "https://vidlink.pro/movie/36647",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/O2Y3FFFIvRI",
        "genre": [
            "Superhero",
            "Supernatural Horror",
            "Vampire Horror",
            "Action",
            "Horror",
            "Sci-Fi"
        ],
        "key_words": [
            "Blade 1998",
            "Blade",
            "1998"
        ],
        "description": "In a world where vampires walk the earth, Blade has a goal. His goal is to rid the world of all vampire evil. When Blade witnesses a vampire bite Dr. Karen Jenson, he fights away the beast and takes Jenson back to his hideout. Here, alongside Abraham Whistler, Blade attempts to help heal Jenson. The vampire Quinn who was attacked by Blade, reports back to his master Deacon Frost, who is planning a huge surprise for the human population."
    },
    {
        "title": "X-Men",
        "poster": "https://image.tmdb.org/t/p/original/bRDAc4GogyS9ci3ow7UnInOcriN.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/yGxMIIDSUvaXUjjJuIYZi40Jt3J.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/A9fpAjZLqsODM96aI6kx147LPM9.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/wYQkUdmS58hPP3Umm0XVtGoeUM6.png",
        "main_src": "https://vidlink.pro/movie/36657",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/s4Wqw8tqgdM",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "X-Men",
            "X-Men 2000",
            "2000"
        ],
        "description": "In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Professor Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him."
    },
    {
        "title": "Blade II",
        "poster": "https://image.tmdb.org/t/p/original/azzTa03g0Fb8HC7O3521qq0oc8Q.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/ftVcl83v6RlH0yiK1Ubkw70VwIf.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/86b0NGY1i0bt3ckhkcHxiCSMxk1.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/vkUddkp0gNmrgPW8eInXKB0apjS.png",
        "main_src": "https://vidlink.pro/movie/36586",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/fcCQ7xk8zzM",
        "genre": [
            "Martial Arts",
            "Superhero",
            "Supernatural Horror",
            "Vampire Horror",
            "Action",
            "Horror",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "Blade II 2002",
            "Blade 2 2002",
            "2002"
        ],
        "description": "A rare mutation has occurred within the vampire community. The Reaper. A vampire so consumed with an insatiable bloodlust that they prey on vampires as well as humans, transforming victims who are unlucky enough to survive into Reapers themselves. Now their quickly expanding population threatens the existence of vampires, and soon there won't be enough humans in the world to satisfy their bloodlust. Blade, Whistler and an armory expert named Scud are curiously summoned by the Shadow Council. The council reluctantly admits that they are in a dire situation and they require Blade's assistance. Blade then tenuously enters into an alliance with The Bloodpack, an elite team of vampires trained in all modes of combat to defeat the Reaper threat. Blade's team and the Bloodpack are the only line of defense which can prevent the Reaper population from wiping out the vampire and human populations."
    },
    {
        "title": "Spider-Man",
        "poster": "https://image.tmdb.org/t/p/original/gh4cZbhZxyTbgxQPxD0dOudNPTn.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/qJzloL8O9YHhiWBrhlPfKAtZu2I.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gkINAPOuwUFo2Qphs3OUUbjUKUZ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/kNPXwReF35JpWBqGw8HadykznPT.png",
        "main_src": "https://vidlink.pro/movie/557",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/t06RUxPbp_c",
        "genre": [
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Spider-Man",
            "Spider-Man 2002",
            "2002"
        ],
        "description": "Based on Marvel Comics' superhero character, this is a story of Peter Parker who is a nerdy high-schooler. He was orphaned as a child, bullied by jocks, and can't confess his crush for his stunning neighborhood girl Mary Jane Watson. To say his life is 'miserable' is an understatement. But one day while on an excursion to a laboratory a runaway radioactive spider bites him... and his life changes in a way no one could have imagined. Peter acquires a muscle-bound physique, clear vision, ability to cling to surfaces and crawl over walls, shooting webs from his wrist ... but the fun isn't going to last. An eccentric millionaire Norman Osborn administers a performance enhancing drug on himself and his maniacal alter ego Green Goblin emerges. Now Peter Parker has to become Spider-Man and take Green Goblin to the task... or else Goblin will kill him. They come face to face and the war begins in which only one of them will survive at the end."
    },
    {
        "title": "Men in Black II",
        "poster": "https://image.tmdb.org/t/p/original/enA22EPyzc2WQ1VVyY7zxresQQr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/o1l6OCqA3pYDZHIc5L1s7CEzCMv.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gaObzSfuj8cLw2xpfphDVEs9aof.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/lRkTX0foJlLAUEYMdLrBKmmhn1R.png",
        "main_src": "https://vidlink.pro/movie/608",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/DMHlNR6x2Sw",
        "genre": [
            "Buddy Comedy",
            "Buddy Cop",
            "Action",
            "Adventure",
            "Comedy",
            "Mystery",
            "Sci-Fi"
        ],
        "key_words": [
            "Men in Black 2 2002",
            "Men in Black II 2002",
            "Men in Black 2",
            "Men in Black II",
            "2002"
        ],
        "description": "Kay and Jay reunite to provide our best, last and only line of defense against a sinister seductress who levels the toughest challenge yet to the MIBs untarnished mission statement: protecting the earth from the scum of the universe. It's been four years since the alien-seeking agents averted an intergalactic disaster of epic proportions. And now it's a race against the clock as Jay must convince Kay-who not only has absolutely no memory of his time spent with the Men In Black, but is also the only living person left with the expertise to save the galaxy-to reunite with the MIB before the earth submits to ultimate destruction."
    },
    {
        "title": "Daredevil",
        "poster": "https://image.tmdb.org/t/p/original/oCDBwSkntYamuw8VJIxMRCtDBmi.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/e7jIX02GiSwsgkU5lMpeKjwq2Zc.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/rM9tazUDuzayuHVWkKpPYfuJkid.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/e3O89Ml6wykMdohlJ8nEpgBVYrF.png",
        "main_src": "https://vidlink.pro/movie/9480",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/t3Xc6FjRfoA",
        "genre": [
            "Action Epic",
            "Gun Fu",
            "Martial Arts",
            "One-Person Army Action",
            "Serial Killer",
            "Superhero",
            "Action",
            "Crime",
            "Drama",
            "Sci-Fi"
        ],
        "key_words": [
            "Daredevil",
            "Daredevil 2003",
            "2003"
        ],
        "description": "Fate deals young orphan Matt Murdock a strange hand when he is doused with hazardous waste. The accident leaves Matt blind but also gives him a heightened 'radar sense' that allows him to 'see' far better than any man. Years later Murdock has grown into a man and becomes a respected criminal attorney. But after he's done his 'day job' Matt takes on a secret identity as 'The Man Without Fear,' Daredevil, the masked avenger that patrols the neighborhood of Hell's Kitchen and New York City to combat the injustice that he cannot tackle in the courtroom."
    },
    {
        "title": "X2: X-Men United",
        "poster": "https://image.tmdb.org/t/p/original/rtrd4qieMAhoUshu83Vi1GazM1O.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/s8ftvFvafWWEhApISamHx32bx6h.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/loixNIKBURXfPcND4noz7E8FqCS.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/Ab2M8vN5oaos3K7uE7B5vLmTzbJ.png",
        "main_src": "https://vidlink.pro/movie/36658",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/yVzqz_zpP20",
        "genre": [
            "Superhero",
            "Action",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "X2: X-Men United 2003",
            "X2 X-Men United 2003",
            "X-Men 2 2003",
            "2003"
        ],
        "description": "Several months have passed since the X-Men defeated Magneto and imprisoned him in a seemingly impregnable plastic chamber. One day, a mutant by the name of Nightcrawler infiltrates the White House and attempts to assassinate the President, setting off a chain reaction of anti-mutant measures by the government. Meanwhile, Logan is trying to discover his past. As scientist named William Stryker discovers Professor X's secret school and Cerebro, Magneto's partner, Mystique, is planning to break her leader out of prison. But when Professor X's school is attacked by Stryker's forces, Logan, Rogue, Iceman, and a few are lucky to escape. Those who remain meet in Boston, where they form an uneasy alliance with Magneto to stop Stryker and rescue Professor X."
    },
    {
        "title": "Hulk",
        "poster": "https://image.tmdb.org/t/p/original/qnngKqAcqfH2pBxDoKu5lxzSbTo.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kYd1ZMWvG9K2Jeop3XWXcTpJ2dB.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gNjZ2R5B1JRSO8k8WCiE8DGReDO.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/bynaNzCI5szeRatWBbNQdMY5Lqm.png",
        "main_src": "https://vidlink.pro/movie/1927",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/2ErnLuJKQA4",
        "genre": [
            "Kaiju",
            "One-Person Army Action",
            "Superhero",
            "Action",
            "Sci-Fi"
        ],
        "key_words": [
            "Hulk",
            "Hulk 2003",
            "2003"
        ],
        "description": "Bruce is an ordinary Gamma expert who one day gets blasted with radiation and somehow survives. But in the process a monster was born. Now whenever he gets angry he grows bigger and stronger until he is no longer Bruce Banner. He becomes The Hulk"
    },
    {
        "title": "The Punisher",
        "poster": "https://image.tmdb.org/t/p/original/7rmA1HwYp2GKM85BL0cVwCaosGr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/9j9qKlz9GvmSD3np6UEwWe6uSb.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/r8ylVdJwUxu9AnO2CzKzxfqx5hh.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/67jsep3Z7PAwnXeMTk8xzYDJNLy.png",
        "main_src": "https://vidlink.pro/movie/7220",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/TqVSFchQEyM",
        "genre": [
            "One-Person Army Action",
            "Superhero",
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "key_words": [
            "The Punisher",
            "2004",
            "The Punisher 2004"
        ],
        "description": "Special agent Frank Castle had it all: A loving family, a great life, and an adventurous job. But when his life is taken away from him by a ruthless criminal and his associates, Frank has become reborn. Now serving as judge, jury, and executioner, he's a new kind of vigilante out to wage a one man war against those who have done him wrong."
    },
    {
        "title": "Spider-Man 2",
        "poster": "https://image.tmdb.org/t/p/original/olxpyq9kJAZ2NU1siLshhhXEPR7.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/8G6HCS82vNxgg5wp7oBDSk32XpF.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/8rpjbBVSmntipKriB27AoPsawMW.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/mSYIoj4eNWMDdxaTIf7xzDqvYDm.png",
        "main_src": "https://vidlink.pro/movie/558",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/3jBFwltrxJw",
        "genre": [
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Spider-Man 2 2004",
            "Spider-Man II 2004",
            "2004"
        ],
        "description": "Peter Parker is an unhappy man: after two years of fighting crime as Spider-Man, his life has begun to fall apart. The girl he loves is engaged to someone else, his grades are slipping, he cannot keep any of his jobs, and on top of it, the newspaper Daily Bugle is attacking him viciously, claiming that Spider-Man is a criminal. He reaches the breaking point and gives up the crime fighter's life, once and for all. But after a failed fusion experiment, eccentric and obsessive scientist Dr. Otto Octavius is transformed into super villain Doctor Octopus, Doc Ock for short, having four long tentacles as extra hands. Peter guesses it might just be time for Spider-Man to return, but would he act upon it?"
    },
    {
        "title": "Blade: Trinity",
        "poster": "https://image.tmdb.org/t/p/original/r6ycjrStmmAqiY1oDjAli9NArCa.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/55885wQeb8XISRccwnfVJ7DDJFM.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/njDpl9B1BA9iX6TvKEZnca0omfQ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/sW4i8zzmZQ3tstiqOk0ASoberyp.png",
        "main_src": "https://vidlink.pro/movie/36648",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/qcHEDGs7eAY",
        "genre": [
            "Superhero",
            "Vampire Horror",
            "Action",
            "Horror",
            "Sci-Fi"
        ],
        "key_words": [
            "Blade: Trinity 2004",
            "Blade Trinity 2004",
            "2004"
        ],
        "description": "Blade finds himself alone surrounded by enemies, fighting an up hill battle with the vampire nation and now humans. He joins forces with a group of vampire hunters who call themselves the Nightstalkers. The vampire nation awakens the king of vampires Dracula from his slumber with intentions of using his primitive blood to become day-walkers. On the other side is Blade and his team manifesting a virus that could wipe out the vampire race once and for all. In the end the two sides will collide and only one will come out victorious, a battle between the ultimate vampire who never knew defeat, facing off against the greatest vampire slayer."
    },
    {
        "title": "Elektra",
        "poster": "https://image.tmdb.org/t/p/original/9Azi1GBNj3gPPwmQWAMcATg7JOl.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/rLMQvYhl6DU6QZVNcJTbs87gVPs.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/tFK3pEREZQDA6cjAXwJEGvSseHQ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/qAi6gUyInQK4RRPKLxpqJ5m5IpD.png",
        "main_src": "https://vidlink.pro/movie/9947",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/etfIjKxKzqw",
        "genre": [
            "Gun Fu",
            "Superhero",
            "Action",
            "Adventure",
            "Crime",
            "Fantasy"
        ],
        "key_words": [
            "Elektra 2005",
            "2005"
        ],
        "description": "In the ultimate battle between good and evil stands a warrior who makes the choice that tips the balance. A strong, mysterious and a deadly sexy action heroine - a lethal synthesis of grace and power. Not long after recovering from seemingly mortal wounds, Elektra has severed all ties with the world, living only for her next assignment. But in an unexpected turn of events, she is forced to make a decision that can take her life in a new direction - or destroy her. Key players in Elektra's journey are Stick, a blind martial arts master responsible for Elektra's 'resurrection,' and Mark Miller and Abby Miller, a father and daughter on the run from The Hand, a powerful syndicate whose members practice the dark version of the martial art Kimagure."
    },
    {
        "title": "Fantastic Four",
        "poster": "https://image.tmdb.org/t/p/original/4YMcYEFS8sFuW3soP1HVmgR3cSm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/nDYz0HDfEiNVCBwhCDay8Ud0n7M.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/qxLi48XQuTkSzz28NCjwIbpkB21.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/mumBSCDUnc5kuy75dgKARu4fiOi.png",
        "main_src": "https://vidlink.pro/movie/9738",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/QIx2jkXYu34",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Fantasy",
            "Sci-Fi"
        ],
        "key_words": [
            "Fantastic Four 2005",
            "2005"
        ],
        "description": "Four astronauts have their lives changed forever, when they end up being hit by a cloud of cosmic radiation. Reed Richards now has the ability to stretch his body like elastic. Sue Storm (Alba) is now the invisible woman. Johnny Storm becomes the human touch and Ben Grimm becomes the 'Thing', a man made out of rock. But there is one problem. The journey's sponsor, Victor Von Doom has also been affected and with full power, is a dangerous force which needs to be stopped, before it's too late."
    },
    {
        "title": "X-Men: The Last Stand",
        "poster": "https://image.tmdb.org/t/p/original/a2xicU8DpKtRizOHjQLC1JyCSRS.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/nYJ9hQe6F82bem3ufHAWBRyYm9m.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/jSKFzC4c3kWjlKo9Ou7D7NMn58C.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/gcTogee6TaQqJehZcronIY0ctYr.png",
        "main_src": "https://vidlink.pro/movie/36668",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/X8ozc_dQprk",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "X-Men: The Last Stand 2006",
            "X-Men The Last Stand 2006",
            "X-Men: 3 2006",
            "X-Men 3 2006",
            "2006"
        ],
        "description": "When a 'cure' is created, which apparently can turn any mutant into a 'normal' human being, there is outrage amongst the mutant community. While some mutants do like the idea of a 'cure', including Rogue, many mutants find that there shouldn't be a 'cure'. Magneto, who still believes a war is coming, recruits a large team of mutants to take down Warren Worthington II and his 'cure'. Might seem easy for the X-Men to stop, but Magneto has a big advantage, which Wolverine doesn't have. Jean Grey has returned, and joined with Magneto. The Dark Phoenix has woken within her, which has the ability to destroy anything in her way, even if that 'anything' is an X-Man."
    },
    {
        "title": "Ghost Rider",
        "poster": "https://image.tmdb.org/t/p/original/d9Oan9XJJ6gRJa64Ifsgp1sXbC4.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/7zS58YPAw002RNejOF1vNB3XHbW.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/ohfWCHT65P7b3kQvZnoy2BL95MB.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/AsFDlONRL3fPH4w0DsjQ7rbtzh9.png",
        "main_src": "https://vidlink.pro/movie/1250",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/nu6R7ypaz5g",
        "genre": [
            "Dark Fantasy",
            "Superhero",
            "Supernatural Fantasy",
            "Action",
            "Fantasy",
            "Thriller"
        ],
        "key_words": [
            "Ghost Rider 2007",
            "2007"
        ],
        "description": "When the motorcyclist Johnny Blaze finds that his father Barton Blaze has terminal cancer, he accepts a pact with Mephistopheles, giving his soul for the health of his beloved father. But the devil deceives him, and Barton dies in a motorcycle accident during an exhibition. Johnny leaves the carnival, his town, his friends, and his girlfriend Roxanne. Many years later, Johnny Blaze becomes a famous motorcyclist, who risks his life in his shows, and he meets Roxanne again, now a television reporter. However, Mephistopheles proposes Johnny to release his contract if he become the 'Ghost Rider' and defeat his evil son Blackheart, who wants to possess one thousand evil souls and transform hell on Earth."
    },
    {
        "title": "Spider-Man 3",
        "poster": "https://image.tmdb.org/t/p/original/sqZKCRYGovZ8aN99VVJSdL8Ja9k.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/eSGBbCOX7KM3Rf8HHwK8tglklyS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/w1oD1MzHjnBJc5snKupIQaSBLIh.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/wPilOoeK96QNMiWI25Xugqu9yVf.png",
        "main_src": "https://vidlink.pro/movie/559",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/wPosLpgMtTY",
        "genre": [
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Spider-Man 3 2007",
            "Spider-Man III 2007",
            "2007"
        ],
        "description": "Peter Parker has finally managed to piece together the once-broken parts of his life, maintaining a balance between his relationship with Mary-Jane and his responsibility as Spider-Man. But more challenges arise for our young hero. Peter's old friend Harry Obsourne has set out for revenge against Peter; taking up the mantle of his late father's persona as The New Goblin, and Peter must also capture Uncle Ben's real killer, Flint Marko, who has been transformed into his toughest foe yet, the Sandman. All hope seems lost when suddenly Peter's suit turns jet-black and greatly amplifies his powers. But it also begins to greatly amplify the much darker qualities of Peter's personality that he begins to lose himself to. Peter has to reach deep inside himself to free the compassionate hero he used to be if he is to ever conquer the darkness within and face not only his greatest enemies, but also...himself."
    },
    {
        "title": "Fantastic Four: Rise of the Silver Surfer",
        "poster": "https://image.tmdb.org/t/p/original/f3ldtPF7SESMcyAIyIJHBLlBBkr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/pQDm7OkY7GAtDwGUcBEysHfMsNv.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/q7wzH2vkcJnVrmoLMCFyo7U3yz2.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/dgbnTqH4IzmhYZvnzyVS5BxHUWV.png",
        "main_src": "https://vidlink.pro/movie/1979",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Wiu5eZ_7vSY",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Fantasy",
            "Sci-Fi"
        ],
        "key_words": [
            "Fantastic Four: Rise of the Silver Surfer 2007",
            "Fantastic Four Rise of the Silver Surfer 2007",
            "Fantastic Four 4: Rise of the Silver Surfer 2007",
            "Fantastic Four 4 2007",
            "2007"
        ],
        "description": "Everything seems to be going great for the Fantastic Four. Reed and Sue are finally getting married, and things couldn't seem better. However, when the mysterious Silver Surfer crashes things, they learn that they will have to deal with an old foe, and the powerful planet eating Galactus."
    },
    {
        "title": "Iron Man",
        "poster": "https://image.tmdb.org/t/p/original/78lPtwv72eTNqFW9COBYI0dWDJa.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/cyecB7godJ6kNHGONFjUyVN9OX5.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/cdsjxSR55VS80IiJfrQ9i9pWqrp.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/cnS4IgI51KwYUNyPz9HRmf4qhUh.png",
        "main_src": "https://vidlink.pro/movie/1726",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/KAE5ymVLmZg",
        "genre": [
            "Sci-Fi Epic",
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Iron Man 2008",
            "2008"
        ],
        "description": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters."
    },
    {
        "title": "The Incredible Hulk",
        "poster": "https://image.tmdb.org/t/p/original/gKzYx79y0AQTL4UAk1cBQJ3nvrm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/jPu8yiadqgzwFPGKJmGo637ASVP.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/oklXjbzJBYz5IGvibvLu59HX42K.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/l0UawWPTpB6uFolo7xqhQdloo8H.png",
        "main_src": "https://vidlink.pro/movie/1724",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/dz6eBeW19Lg",
        "genre": [
            "Kaiju",
            "One-Person Army Action",
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "The Incredible Hulk 2008",
            "2008"
        ],
        "description": "The story of Dr. Bruce Banner, who seeks a cure to his unique condition, which causes him to turn into a giant green monster under emotional stress, is depicted. Whilst on the run from military, which seeks his capture, Banner comes close to a cure. But he must contend with a new creature that emerges: The Abomination."
    },
    {
        "title": "Punisher: War Zone",
        "poster": "https://image.tmdb.org/t/p/original/oOvKJgYUIpfswGHAdW6159bPbvM.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/sPDIOvqyVzPo1Xu46BAB6aSGvSF.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/lx8SzVE62vZcPSvabdzWIMQijce.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/tP5PRhSS8PtjmTCleIcx6Esq9j9.png",
        "main_src": "https://vidlink.pro/movie/13056",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/liABMxEvPAc",
        "genre": [
            "Superhero",
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "key_words": [
            "Punisher: War Zone 2008",
            "Punisher War Zone 2008",
            "Punisher 2: War Zone 2008",
            "Punisher 2 2008",
            "2008"
        ],
        "description": "Frank Castle, the ex-military man whose family was killed by criminals, who became a vigilante known as the Punisher, goes after a whole mob family and gets everyone except enforcer Billy Russoti. He tracks Russoti down and chases him into a vat that is used for crushing bottles. Frank turns on the crusher hoping it would take care of him but it doesn't. He survives but sustains very severe injuries that even with plastic surgery his face looks like a jigsaw puzzle. So he decides to adopt the name Jigsaw. Frank who killed one of Russoti's people who unknown to him is an undercover Fed, decides to pack it in. But when he learns Russoti didn't die and is looking for the money he entrusted to the Fed and will go looking for it at his home which means his family is in danger. So Frank tries to save them. But Russoti wants revenge on Frank so he breaks out his brother who is so crazed that he is committed to an asylum, to deal with him. And also another Fed who's a friend of the man Frank killed wants him too"
    },
    {
        "title": "X-Men Origins: Wolverine",
        "poster": "https://image.tmdb.org/t/p/original/yj8LbTju1p7CUJg7US2unSBk33s.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/wvqdJLVh0mSblly7UnYFPEk04Wd.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/kxDCq0RbHwVzVHUkxDi67Xilrrx.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/hqVryMGnnreF8uWF5NKdpPhOxBO.png",
        "main_src": "https://vidlink.pro/movie/2080",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/PzyjvWiigxg",
        "genre": [
            "Superhero",
            "Action",
            "Sci-Fi"
        ],
        "key_words": [
            "X-Men Origins: Wolverine 2009",
            "X-Men Origins Wolverine 2009",
            "2009"
        ],
        "description": "Two mutant brothers, Logan and Victor, born 200 years ago, suffer childhood trauma and have only each other to depend upon. Basically, they're fighters and killers, living from war to war throughout U.S. history. In modern times, U.S. Colonel Stryker recruits them and other mutants as commandos. Logan quits and becomes a logger, falling in love with a local teacher. When Logan refuses to rejoin Stryker's crew, the Colonel sends the murderous Victor. Logan now wants revenge."
    },
    {
        "title": "Dragon",
        "poster": "https://image.tmdb.org/t/p/original/vKNJPuejtE6Xrp6RK6LKsQcbL8L.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/eie4xlRg5RZAbOklRVnmQoMew6M.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/8y8pxJwYEK1WvQAfoZTwC601eD8.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/rvVDW5K1ndZYZVGkqNk20u6MwUc.png",
        "main_src": "https://Smoothpre.com/embed/k0bgk1ll1ibf",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/qlBZlbJ7Nue",
        "genre": [
            "Comedy",
            "Drama",
            "Romance"
        ],
        "key_words": [
            "Dragon",
            "Dragon 2025",
            "2025"
        ],
        "description": "After a devastating breakup, troubled student Ragavan abandons his studies and enters the dangerous world of financial fraud, pursuing wealth and power while becoming entangled in escalating deception."
    },
    {
        "title": "Kick-Ass",
        "poster": "https://image.tmdb.org/t/p/original/iHMbrTHJwocsNvo5murCBw0CwTo.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/P4bGyJQF0shAcRku3I2perNUQR.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/dNtVnKSZScSnmFYBco0tgB2k6HC.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/pDLmFlKLIZD2LvJdDknOPU5ts4q.png",
        "main_src": "https://vidlink.pro/movie/23483",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/rFpWpkxsVI8",
        "genre": [
            "Dark Comedy",
            "Superhero",
            "Teen Comedy",
            "Action",
            "Comedy",
            "Crime"
        ],
        "key_words": [
            "Jane Goldman (screenplay)",
            "Matthew Vaughn (screenplay)",
            "Aaron Taylor-Johnson",
            "Nicolas Cage",
            "Chlo Grace Moretz",
            "Matthew Vaughn",
            "Kick-Ass 2010"
        ],
        "description": "Dave Lizewski is an unnoticed high school student and comic book fan with a few friends and who lives alone with his father. His life is not very difficult and his personal trials not that overwhelming; however, one day he makes the simple decision to become a super-hero, even though he has no powers or training."
    },
    {
        "title": "Iron Man 2",
        "poster": "https://image.tmdb.org/t/p/original/6WBeq4fCfn7AN0o21W9qNcRF2l9.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/7lmBufEG7P7Y1HClYK3gCxYrkgS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/hCVQPB77eXBGh9abVdrWtKpKgkN.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/z4hbuJsQlsX1O1202xSbv7xBYyX.png",
        "main_src": "https://vidlink.pro/movie/10138",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/BoohRoVA9WQ",
        "genre": [
            "Action",
            "Adventure",
            "Hollywood Movies 2010-11 Dual Audio Eng-Hin",
            "Marvel Cinematic Universe MCU Movies",
            "Science Fiction"
        ],
        "key_words": [
            "Don Cheadle",
            "Gwyneth Paltrow",
            "Mickey Rourke",
            "Robert Downey Jr.",
            "Sam Rockwell",
            "Samuel L. Jackson",
            "Scarlett Johansson",
            "Jon Favreau",
            "Iron Man 2  2010",
            "Iron Man 2 2010",
            "Iron Man II 2010",
            "2010"
        ],
        "description": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press, and the public to share his technology with the military. Unwilling to let go of his invention, Stark, along with Pepper Potts, and James 'Rhodey' Rhodes at his side, must forge new alliances - and confront powerful enemies."
    },
    {
        "title": "Thor",
        "poster": "https://image.tmdb.org/t/p/original/prSfAi1xGrhLQNxVSUFh61xQ4Qy.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/cDJ61O1STtbWNBwefuqVrRe3d7l.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/cgRtc2ifBS9UHa0GbSmwg1Blahe.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/jE6T4AD9ZmMdaAsW2K2CsQamxqb.png",
        "main_src": "https://vidlink.pro/movie/10195",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/uHBnrJowBZE",
        "genre": [
            "Action",
            "Adventure",
            "Fantasy",
            "Hollywood Movies 2010-11 Dual Audio Eng-Hin",
            "Marvel Cinematic Universe MCU Movies"
        ],
        "key_words": [
            "Anthony Hopkins",
            "Chris Hemsworth",
            "Clark Gregg",
            "Kat Dennings",
            "Natalie Portman",
            "Stellan Skarsgrd",
            "Tom Hiddleston",
            "Kenneth Branagh",
            "Thor 2011",
            "2011"
        ],
        "description": "Against his father Odins will, The Mighty Thor  a powerful but arrogant warrior god  recklessly reignites an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth."
    },
    {
        "title": "X-Men: First Class",
        "poster": "https://image.tmdb.org/t/p/original/hNEokmUke0dazoBhttFN0o3L7Xv.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/bMiOfPhplZu1Lql3hGTRV087QA.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/mCinjxmq2tRDzSgc8QcuRkV8yTo.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/g7ttyPk6Qac3kidNgxklDe7qeTE.png",
        "main_src": "https://vidlink.pro/movie/49538",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/XKF6J6kgs0s",
        "genre": [
            "Action",
            "Adventure",
            "Hollywood Movies 2010-11 Dual Audio Eng-Hin",
            "Science Fiction"
        ],
        "key_words": [
            "Bill Milner",
            "James McAvoy",
            "Jennifer Lawrence",
            "Kevin Bacon",
            "Laurence Belcher",
            "Michael Fassbender",
            "Rose Byrne",
            "Matthew Vaughn",
            "X-Men 5: First Class 2011",
            "X-Men 5 First Class 2011",
            "X-Men 5 2011",
            "2011"
        ],
        "description": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were arch-enemies, they were closest of friends, working together with other mutants (some familiar, some new), to stop the greatest threat the world has ever known."
    },
    {
        "title": "Captain America: The First Avenger",
        "poster": "https://image.tmdb.org/t/p/original/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/yFuKvT4Vm3sKHdFY4eG6I4ldAnn.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/4NWWpT0jiMUak8r6jfpvG4eBgFU.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/1GPeoEcMOUvkgwRXY76s9zE57I9.png",
        "main_src": "https://vidlink.pro/movie/1771",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/W4DlMggBPvc",
        "genre": [
            "Superhero",
            "action-adventure",
            "war",
            "science fiction",
            "period drama"
        ],
        "key_words": [
            "Captain America: The First Avenger",
            "Captain America",
            "Steve Rogers",
            "Chris Evans",
            "Joe Johnston",
            "Marvel Cinematic Universe",
            "MCU",
            "Red Skull",
            "Johann Schmidt",
            "Hugo Weaving",
            "Peggy Carter",
            "Hayley Atwell",
            "Bucky Barnes",
            "Sebastian Stan",
            "Tesseract",
            "World War II",
            "super-soldier",
            "vibranium shield",
            "Howling Commandos",
            "Nick Fury",
            "Samuel L. Jackson",
            "Howard Stark",
            "Dominic Cooper",
            "Dr. Abraham Erskine",
            "Stanley Tucci",
            "Colonel Chester Phillips",
            "Tommy Lee Jones",
            "Arnim Zola",
            "Toby Jones",
            "Dum Dum Dugan",
            "Neal McDonough",
            "James \"Bucky\" Barnes",
            "1940s setting",
            "period piece",
            "action sequences",
            "visual effects",
            "origin story",
            "Captain America's shield",
            "HYDRA",
            "S.H.I.E.L.D.",
            "Phase One",
            "Marvel Studios",
            "Paramount Pictures",
            "124-minute runtime",
            "July 22",
            "2011 release",
            "$140 million budget",
            "$370.6 million box office gross"
        ],
        "description": "'Captain America: The First Avenger' serves as the origin story for one of Marvel's most iconic heroes. In 1941, amidst the global turmoil of World War II, Steve Rogers, portrayed by Chris Evans, is a diminutive and frail young man determined to serve his country. Despite repeated rejections due to his health, Rogers's unwavering spirit catches the attention of Dr. Abraham Erskine, a scientist leading a top-secret super-soldier program. Undergoing the experimental procedure, Rogers is transformed into Captain America, a symbol of hope and strength.\n\nInitially used for propaganda, Captain America's true test comes when he learns that his friend, Bucky Barnes, and other soldiers have been captured by the Red Skull, the leader of the Nazi-backed HYDRA organization. Taking matters into his own hands, Rogers leads a daring rescue mission, freeing his comrades and confronting the Red Skull. The Red Skull, portrayed by Hugo Weaving, is a formidable adversary who seeks to harness the power of the Tesseract, a cosmic artifact capable of unimaginable destruction.\n\nAs Rogers battles HYDRA forces across Europe, he forms the Howling Commandos, a group of elite soldiers who aid in sabotaging enemy operations. Alongside Peggy Carter, played by Hayley Atwell, Rogers navigates the complexities of leadership, friendship, and burgeoning romance. The film culminates in a high-stakes confrontation where Rogers must prevent the Red Skull from unleashing catastrophic weapons on major American cities. In a selfless act, Rogers crashes a HYDRA aircraft into the Arctic, sacrificing himself to save millions.\n\nDecades later, Rogers awakens in a world vastly different from the one he knew, setting the stage for his integration into the modern-day Avengers. 'Captain America: The First Avenger' not only introduces audiences to a beloved character but also lays the groundwork for the expansive narrative of the Marvel Cinematic Universe. The film received positive reviews for its storytelling, performances, and seamless blend of historical events with superhero fiction. It stands as a testament to the enduring appeal of Captain America's legacy."
    },
    {
        "title": "Ghost Rider: Spirit of Vengeance",
        "poster": "https://image.tmdb.org/t/p/original/fUJOWsjjE8u1r4YOLYe1RLYy7bm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/cPzyhThnrsmn0t0CxOggBeGrNwn.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/aHc765LRg5d5DtoS4LKiGEROWrq.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/6rIQU19Zl1VbiyXWPEQUcpqEen6.png",
        "main_src": "https://vidlink.pro/movie/71676",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/ibZPd9MX0zg",
        "genre": [
            "Superhero",
            "action-adventure",
            "fantasy",
            "horror",
            "thriller"
        ],
        "key_words": [
            "Ghost Rider: Spirit of Vengeance",
            "Ghost Rider",
            "Johnny Blaze",
            "Nicolas Cage",
            "Mark Neveldine",
            "Brian Taylor",
            "sequel",
            "2011",
            "Marvel Comics",
            "Ciarn Hinds",
            "Mephistopheles",
            "Violante Placido",
            "Nadya",
            "Johnny Whitworth",
            "Blackout",
            "Christopher Lambert",
            "Methodius",
            "Idris Elba",
            "Moreau",
            "Danny Ketch",
            "Fergus Riordan",
            "Ray Carrigan",
            "Roarke",
            "Eastern Europe",
            "Romania",
            "Turkey",
            "supernatural",
            "demon",
            "Penance Stare",
            "motorcycle",
            "stuntman",
            "curse",
            "redemption",
            "action sequences",
            "visual effects",
            "3D",
            "95-minute runtime",
            "$57 million budget",
            "$132.6 million box office gross",
            "critical reception",
            "Rotten Tomatoes",
            "Metacritic",
            "Cinemascore",
            "Blu-ray",
            "DVD",
            "streaming",
            "Hulu"
        ],
        "description": "'Ghost Rider: Spirit of Vengeance' follows Johnny Blaze (Nicolas Cage), a motorcycle stuntman burdened with the curse of the Ghost Rider, a demonic entity that compels him to punish evil. Hiding in Eastern Europe, Blaze is approached by a secret religious sect led by Moreau (Idris Elba), who offers him a chance at redemption. They seek his help in protecting a young boy named Danny (Fergus Riordan), the son of the demon lord Mephistopheles (Ciarn Hinds), who plans to transfer his essence into Danny's body to regain his youth and power.\n\nTeaming up with Danny and his mother Nadya (Violante Placido), Blaze confronts various adversaries, including Ray Carrigan (Johnny Whitworth), who transforms into Blackout, a being capable of decaying anything he touches. As they journey through Romania and Turkey, Blaze battles both human and supernatural forces, culminating in a showdown to prevent Mephistopheles from taking over Danny's body. In the end, Blaze manages to thwart Mephistopheles' plan, saving Danny and earning a measure of redemption. \n\nDespite its star-studded cast and high-octane action sequences, 'Ghost Rider: Spirit of Vengeance' received predominantly negative reviews from critics, who cited issues with the script, special effects, and performances. The film holds an approval rating on Rotten Tomatoes, with the consensus stating, 'With a weak script, uneven CG work, and a Nic Cage performance so predictably loony it's no longer amusing, Ghost Rider: Spirit of Vengeance aims to be trashy fun but ends up as plain trash.'\n\nHowever, over time, some viewers have come to appreciate the film's unique style and Nicolas Cage's committed performance, finding enjoyment in its over-the-top action and visual flair. As of December 2024, 'Ghost Rider: Spirit of Vengeance' is available for streaming on Hulu, offering a chance for audiences to revisit this unconventional superhero tale. "
    },
    {
        "title": "Men in Black 3",
        "poster": "https://image.tmdb.org/t/p/original/90DdoEStzeObs96fsYf4GG544iN.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/5AhpUb8CAP0jZ4Wrn7AsRUYjZxB.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/bgslxHUmtCncOa9hOIDsVBarfyc.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/a2iSCAj6s9v578A1sKqkOeV6824.png",
        "main_src": "https://vidlink.pro/movie/41154",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Y2r9AIfYcV8",
        "genre": [
            "Science fiction",
            "action-comedy",
            "time travel",
            "adventure",
            "fantasy"
        ],
        "key_words": [
            "Men in Black 3",
            "Men in Black",
            "Agent J",
            "Agent K",
            "Will Smith",
            "Tommy Lee Jones",
            "Josh Brolin",
            "Barry Sonnenfeld",
            "time travel",
            "1969",
            "Boris the Animal",
            "Jemaine Clement",
            "Griffin",
            "Michael Stuhlbarg",
            "Agent O",
            "Emma Thompson",
            "Alice Eve",
            "Andy Warhol",
            "Bill Hader",
            "Agent W",
            "Agent X",
            "David Rasche",
            "Agent AA",
            "Will Arnett",
            "K's backstory",
            "J's father",
            "Colonel James Darrell Edwards II",
            "Mike Colter",
            "Cape Canaveral",
            "Apollo 11",
            "ArcNet",
            "Boglodites",
            "Shea Stadium",
            "alien invasion",
            "Earth protection",
            "secret organization",
            "neuralyzer",
            "extraterrestrial life",
            "New York City",
            "2012 release",
            "$215 million budget",
            "$654.2 million box office gross",
            "critical reception",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming",
            "Netflix",
            "Max"
        ],
        "description": "'Men in Black 3' continues the adventures of Agents J and K as they protect Earth from extraterrestrial threats. In 2012, alien criminal Boris the Animal escapes from a maximum-security prison on the Moon, seeking revenge on Agent K, who had previously captured him. Boris travels back in time to 1969 to kill the younger K, altering the course of history. Agent J, unaffected by the timeline change, realizes that Earth's safety is at risk and decides to follow Boris into the past. \n\nIn 1969, Agent J teams up with the younger Agent K, portrayed by Josh Brolin, to prevent Boris's plan and restore the timeline. They encounter various challenges, including locating Griffin, an alien with the ability to see multiple possible futures, who holds the key to saving Earth. The agents' journey leads them to Cape Canaveral, where they must ensure the success of the Apollo 11 mission to deploy the ArcNet, a protective shield against the Boglodites. Along the way, Agent J uncovers personal truths about his own history, including the identity of his father, Colonel James Darrell Edwards II, portrayed by Mike Colter.\n\nThe film combines action-packed sequences with humor and heart, exploring themes of friendship, sacrifice, and destiny. It received generally positive reviews from critics, who praised the performances, particularly Brolin's portrayal of the younger Agent K, and considered it an improvement over its predecessor. "
    },
    {
        "title": "The Amazing Spider-Man",
        "poster": "https://image.tmdb.org/t/p/original/jexoNYnPd6vVrmygwF6QZmWPFdu.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/ac0kRKTfiJ4GcoUfb0XIO5vgC8q.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/HVcza6tJtWFrLriuh3Ano4Vt46.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/lixl4MpYcx7f2GaQrjmSgTs5wMU.png",
        "main_src": "https://vidlink.pro/movie/1930",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/WLxul0Vzuhk",
        "genre": [
            "Superhero",
            "action-adventure",
            "fantasy",
            "science fiction"
        ],
        "key_words": [
            "The Amazing Spider-Man",
            "Spider-Man reboot",
            "Marc Webb",
            "Andrew Garfield",
            "Emma Stone",
            "Rhys Ifans",
            "Dr. Curt Connors",
            "Lizard",
            "Peter Parker origin story",
            "Gwen Stacy",
            "Oscorp",
            "radioactive spider bite",
            "New York City",
            "2012 release",
            "$200 million budget",
            "$758.7 million box office gross",
            "visual effects",
            "3D",
            "Blu-ray",
            "DVD",
            "streaming",
            "Netflix",
            "Max",
            "Rotten Tomatoes",
            "Metacritic",
            "IMDb",
            "superhero origin film",
            "rebooted franchise",
            "Marc Webb direction",
            "Andrew Garfield performance",
            "Emma Stone as Gwen Stacy",
            "Rhys Ifans as Lizard",
            "Martin Sheen as Uncle Ben",
            "Sally Field as Aunt May",
            "Denis Leary as Captain Stacy",
            "Campbell Scott as Richard Parker",
            "Irrfan Khan as Rajit Ratha",
            "Oscorp Tower",
            "Stan Lee cameo",
            "Spider-Man suit design",
            "web-shooters",
            "high school romance",
            "action sequences",
            "critical reception",
            "fan opinions"
        ],
        "description": "'The Amazing Spider-Man' reimagines the origin story of Peter Parker, a high school student in New York City who gains spider-like abilities after being bitten by a genetically altered spider. Struggling with the disappearance of his parents, Peter delves into their past, leading him to Oscorp and the laboratory of Dr. Curt Connors. As Peter embraces his newfound powers, he confronts personal challenges and the emergence of the Lizard, a monstrous alter ego of Dr. Connors. The film explores themes of responsibility, identity, and the impact of choices, setting the stage for a new era of Spider-Man storytelling."
    },
    {
        "title": "The Avengers",
        "poster": "https://image.tmdb.org/t/p/original/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/nNmJRkg8wWnRmzQDe2FwKbPIsJV.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/hdCTtnf7E7vcxInVAKzYFczj7nT.png",
        "main_src": "https://vidlink.pro/movie/24428",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/hIR8Ar-Z4hw",
        "genre": [
            "Superhero",
            "action-adventure",
            "science fiction",
            "fantasy"
        ],
        "key_words": [
            "The Avengers",
            "Marvel's The Avengers",
            "Joss Whedon",
            "Robert Downey Jr.",
            "Chris Evans",
            "Mark Ruffalo",
            "Chris Hemsworth",
            "Scarlett Johansson",
            "Jeremy Renner",
            "Tom Hiddleston",
            "Stellan Skarsgrd",
            "Samuel L. Jackson",
            "Nick Fury",
            "S.H.I.E.L.D.",
            "Loki",
            "Tesseract",
            "Chitauri",
            "New York City battle",
            "Iron Man",
            "Captain America",
            "Hulk",
            "Thor",
            "Black Widow",
            "Hawkeye",
            "Phase One",
            "Marvel Cinematic Universe",
            "ensemble cast",
            "2012 release",
            "$220 million budget",
            "$1.521 billion box office gross",
            "visual effects",
            "action sequences",
            "team dynamics",
            "character development",
            "critical acclaim",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'The Avengers' marks a pivotal moment in the Marvel Cinematic Universe (MCU), uniting multiple superheroes to confront an existential threat to Earth. The film opens with Loki, Thor's adoptive brother, seizing the Tesseracta powerful energy source capable of opening interdimensional portals. Loki's alliance with the Chitauri, an extraterrestrial race, sets the stage for an invasion aimed at subjugating Earth.\n\nIn response, Nick Fury, director of the international peacekeeping agency S.H.I.E.L.D., activates the 'Avengers Initiative.' He recruits Iron Man, Captain America, Hulk, Thor, Black Widow, and Hawkeye to form a team capable of countering the looming threat. Initially, the team's diverse personalities and approaches lead to internal conflicts. However, the looming threat of the Chitauri invasion necessitates collaboration.\n\nThe climactic battle unfolds in New York City, where the Avengers coordinate their unique abilities to thwart the invasion. Iron Man intercepts a nuclear missile intended to decimate the city, guiding it through the portal to destroy the Chitauri mothership. This act disables the invading forces, leading to a decisive victory for the team. In the aftermath, the Avengers part ways, aware that future challenges may require their united efforts once more."
    },
    {
        "title": "Iron Man 3",
        "poster": "https://image.tmdb.org/t/p/original/kwdWTa5wjFGJbFY2mpofgg91xHp.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/iVped1djsF0tvGkvnHbzsE3ZPTF.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/4TSqtluelcWByj8YZdqwzQVjI0O.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/tKbLuG9R3rZsDbo40qLcxIXijhP.png",
        "main_src": "https://vidlink.pro/movie/68721",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/YLorLVa95Xo",
        "genre": [
            "Superhero",
            "action-adventure",
            "science fiction",
            "thriller"
        ],
        "key_words": [
            "Iron Man 3",
            "Tony Stark",
            "Robert Downey Jr.",
            "Shane Black",
            "Marvel Cinematic Universe",
            "Gwyneth Paltrow",
            "Pepper Potts",
            "Don Cheadle",
            "James Rhodes",
            "Guy Pearce",
            "Aldrich Killian",
            "Rebecca Hall",
            "Maya Hansen",
            "Ben Kingsley",
            "Mandarin",
            "Extremis",
            "Iron Patriot",
            "J.A.R.V.I.S.",
            "Harley Keener",
            "Ty Simpkins",
            "Los Angeles",
            "Tennessee",
            "Air Force One",
            "Air Force Two",
            "Aldrich Killian",
            "AIM",
            "Advanced Idea Mechanics",
            "presidential kidnapping",
            "Iron Man suits",
            "Mark XLII",
            "Mark XLIII",
            "Mark XLIV",
            "Mark XLV",
            "Mark XLVI"
        ],
        "description": "'Iron Man 3' is a 2013 American superhero film directed by Shane Black, based on the Marvel Comics character Iron Man. It serves as the seventh installment in the Marvel Cinematic Universe (MCU) and the third film in the Iron Man series. The movie stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Gwyneth Paltrow, Don Cheadle, Guy Pearce, Rebecca Hall, and Ben Kingsley."
    },
    {
        "title": "Kick-Ass 2",
        "poster": "https://image.tmdb.org/t/p/original/1go2A3gdQjaMuHWquybgoJlQRcX.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/dHBYguQvCDa00GMoidNYa7IOD8y.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/AkBLdx5W9rqUgQwm3jwjuRdFact.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/jpAo8Xro29KhSKThundneOjUoWQ.png",
        "main_src": "https://vidlink.pro/movie/59859",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/1zcMLxIuuww",
        "genre": [
            "Superhero",
            "action-comedy",
            "crime",
            "thriller"
        ],
        "key_words": [
            "Kick-Ass 2",
            "Jeff Wadlow",
            "Aaron Taylor-Johnson",
            "Chlo Grace Moretz",
            "Christopher Mintz-Plasse",
            "Jim Carrey",
            "The Motherfucker",
            "Hit-Girl",
            "Kick-Ass",
            "Colonel Stars and Stripes",
            "Mindy Macready",
            "Dave Lizewski",
            "Red Mist",
            "supervillains",
            "Justice Forever",
            "crime-fighting team",
            "vigilantes",
            "high school",
            "revenge",
            "action sequences",
            "humor",
            "violence",
            "graphic novel adaptation",
            "Mark Millar",
            "John Romita Jr.",
            "2013 release",
            "$28 million budget",
            "$60.8 million box office gross",
            "mixed reviews",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Amazon Prime Video"
        ],
        "description": "'Kick-Ass 2' continues the story of Dave Lizewski, a teenager who, inspired by his own desire for heroism, becomes the masked vigilante Kick-Ass. After his initial foray into crime-fighting, Dave seeks out others who share his passion, leading him to join Justice Forever, a group of amateur superheroes led by Colonel Stars and Stripes. Meanwhile, Mindy Macready, known as Hit-Girl, attempts to live a normal life as a high school student, distancing herself from her violent past. However, her efforts are thwarted when Chris D'Amico, seeking revenge for his father's death, adopts the persona of The Motherfucker and assembles a team of supervillains. This sets the stage for an epic showdown between the forces of good and evil, filled with intense action sequences, dark humor, and the exploration of themes such as friendship, responsibility, and the consequences of vigilantism."
    },
    {
        "title": "The Wolverine",
        "poster": "https://image.tmdb.org/t/p/original/8lzmovtARDXnE7kTDOum02i6fXv.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/i8ZbNCoPft7aIZmRsCugVfydjwz.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/7D2PgX369YYePs4m44IQvROWM42.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/uBeNeuKx0hmVFi2KM7nUUl6YEq6.png",
        "main_src": "https://vidlink.pro/movie/76170",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/DwG56k6VGOE",
        "genre": [
            "Superhero",
            "action-adventure",
            "fantasy",
            "thriller"
        ],
        "key_words": [
            "The Wolverine",
            "Hugh Jackman",
            "James Mangold",
            "Logan",
            "X-Men",
            "Japan",
            "samurai",
            "mutants",
            "healing factor",
            "Silver Samurai",
            "Viper",
            "Mariko Yashida",
            "Yukio",
            "Shingen Yashida",
            "Yashida Industries",
            "Harada",
            "Jean Grey",
            "Famke Janssen",
            "Rila Fukushima",
            "Tao Okamoto",
            "Hiroyuki Sanada",
            "Will Yun Lee",
            "Brian Tee",
            "action sequences",
            "character development",
            "2013 release",
            "$100132 million budget",
            "$414.8 million box office gross",
            "critical reception",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'The Wolverine' delves into Logan's life following the traumatic events of 'X-Men: The Last Stand,' where he was forced to kill Jean Grey. Seeking solitude, Logan retreats to the wilderness but is drawn to Japan by an invitation from Yashida, a man whose life he saved during World War II. In Japan, Logan becomes embroiled in a complex world of yakuza, samurai, and corporate intrigue. He meets Mariko Yashida, Yashida's granddaughter, who becomes central to a conflict involving her family's powerful corporation. Logan's healing abilities are mysteriously suppressed, making him vulnerable for the first time in years. As he battles formidable foes, including the enigmatic Viper and the formidable Silver Samurai, Logan confronts his own mortality and grapples with his haunted past. The film combines intense action sequences with emotional depth, exploring themes of honor, redemption, and the burden of immortality."
    },
    {
        "title": "Thor: The Dark World",
        "poster": "https://image.tmdb.org/t/p/original/wD6g4EcmR6R3VNbuBmNOVq2qWrM.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/uhYoytlNaq46dG81wLmHqaSuzWu.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/90seuFwm25GWNbF1ydkaPa4DrdO.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/wPT7BCQH56zGfSNduDqY8EOoRVl.png",
        "main_src": "https://vidlink.pro/movie/76338",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/npvJ9FTgZbM",
        "genre": [
            "Superhero",
            "action-adventure",
            "fantasy",
            "science fiction"
        ],
        "key_words": [
            "Thor: The Dark World",
            "Alan Taylor",
            "Chris Hemsworth",
            "Natalie Portman",
            "Tom Hiddleston",
            "Stellan Skarsgrd",
            "Idris Elba",
            "Christopher Eccleston",
            "Malekith",
            "Aether",
            "Jane Foster",
            "Asgard",
            "Nine Realms",
            "Convergence",
            "Loki",
            "Frigga",
            "Yggdrasil",
            "Bifrst",
            "Heimdall",
            "Sif",
            "Warriors Three",
            "Dark Elves",
            "Svartalfheim",
            "London",
            "Greenwich",
            "Marvel Cinematic Universe",
            "Phase Two",
            "2013 release",
            "$150272.1 million budget",
            "$644.8 million box office gross",
            "mixed reviews",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'Thor: The Dark World' continues the saga of Thor, the Norse God of Thunder, as he confronts a new threat to the universe. The film begins with a flashback to ancient times, where Thor's grandfather, Bor, battles the Dark Elves led by Malekith, who seeks to use a powerful weapon known as the Aether to plunge the universe into darkness. After defeating Malekith, Bor hides the Aether to prevent its misuse.\n\nIn the present day, following the events of 'The Avengers' (2012), Thor is engaged in restoring peace across the Nine Realms, which have been in turmoil since the Bifrst Bridge's destruction. During this time, astrophysicist Jane Foster, Thor's love interest, inadvertently becomes host to the Aether when she is transported to a hidden realm during a cosmic event known as the Convergence. This occurrence awakens Malekith, who has been in suspended animation, and he launches an attack on Asgard to capture Jane and harness the Aether's power.\n\nIn the ensuing battle, Thor's mother, Frigga, is killed while protecting Jane. Devastated by her death, Thor defies his father, Odin, and forms an alliance with his adoptive brother, Loki, who is imprisoned for his role in previous conflicts. Together, they embark on a daring mission to confront Malekith and prevent him from using the Aether to destroy the universe.\n\nTheir journey takes them across various realms, including Svartalfheim, the Dark Elves' homeworld, and Earth, culminating in a final battle in Greenwich, London, where the Convergence reaches its peak. Thor and Loki's alliance is tested, revealing complex family dynamics and challenging their perceptions of heroism and betrayal.\n\nThe film concludes with Thor returning to Asgard, choosing to remain a warrior rather than ascending to the throne, while Loki's fate leaves room for future intrigue. 'Thor: The Dark World' expands the MCU's cosmic narrative, introducing new characters and setting the stage for subsequent storylines."
    },
    {
        "title": "Captain America: The Winter Soldier",
        "poster": "https://image.tmdb.org/t/p/original/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/1RWLMyC9KcFfcaoViMiJGSSZzzr.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/xOe8nHr5bpPvq4JbGy4vpttDwg2.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/7taEKhcDUfQyUV5F0vPAnzs0bYm.png",
        "main_src": "https://vidlink.pro/movie/100402",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/7SlILk2WMTI",
        "genre": [
            "Superhero",
            "action-adventure",
            "espionage",
            "thriller",
            "science fiction"
        ],
        "key_words": [
            "Captain America: The Winter Soldier",
            "Anthony Russo",
            "Joe Russo",
            "Chris Evans",
            "Scarlett Johansson",
            "Sebastian Stan",
            "Anthony Mackie",
            "Cobie Smulders",
            "Frank Grillo",
            "Emily VanCamp",
            "Hayley Atwell",
            "Toby Jones",
            "Jenny Agutter",
            "Robert Redford",
            "Samuel L. Jackson",
            "Steve Rogers",
            "Natasha Romanoff",
            "Bucky Barnes",
            "Sam Wilson",
            "S.H.I.E.L.D.",
            "Hydra",
            "espionage thriller",
            "Marvel Cinematic Universe",
            "Phase Two",
            "2014 release",
            "$170177 million budget",
            "$714.4 million box office gross",
            "critical acclaim",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'Captain America: The Winter Soldier' follows Steve Rogers (Chris Evans) as he adjusts to modern life in Washington, D.C., working for the espionage agency S.H.I.E.L.D. During a mission with Agent Natasha Romanoff (Scarlett Johansson) to rescue hostages from pirates, Rogers discovers that Romanoff has a separate assignment to extract data from the ship's computers.\n\nUpon returning to S.H.I.E.L.D.'s headquarters, Rogers learns about Project Insighta plan to use advanced satellites and Helicarriers to eliminate potential threats before they occur. Director Nick Fury (Samuel L. Jackson) becomes suspicious of the project and is subsequently attacked by a mysterious assassin known as the Winter Soldier (Sebastian Stan). Before his apparent death, Fury warns Rogers that S.H.I.E.L.D. is compromised.\n\nBranded a fugitive, Rogers teams up with Romanoff and new ally Sam Wilson (Anthony Mackie), who becomes the Falcon, to uncover a conspiracy within S.H.I.E.L.D. They discover that Hydra, a nefarious organization, has infiltrated S.H.I.E.L.D. and is using the Winter Soldier to carry out covert missions. The film culminates in a high-stakes battle to prevent Hydra's plan to use the Helicarriers to eliminate perceived threats globally"
    },
    {
        "title": "The Amazing Spider-Man 2",
        "poster": "https://image.tmdb.org/t/p/original/dGjoPttcbKR5VWg1jQuNFB247KL.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/k0hlAzTryCYX1O1LyC6P8tAa8s0.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/u7SeO6Y42P7VCTWLhpnL96cyOqd.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/8ybXuz5BHVq9kJTEJvB50VJuypH.png",
        "main_src": "https://vidlink.pro/movie/102382",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/DlM2CWNTQ84",
        "genre": [
            "Superhero",
            "action-adventure",
            "fantasy",
            "science fiction"
        ],
        "key_words": [
            "The Amazing Spider-Man 2",
            "Marc Webb",
            "Andrew Garfield",
            "Emma Stone",
            "Jamie Foxx",
            "Dane DeHaan",
            "Campbell Scott",
            "Embeth Davidtz",
            "Colm Feore",
            "Paul Giamatti",
            "Sally Field",
            "Peter Parker",
            "Gwen Stacy",
            "Electro",
            "Green Goblin",
            "Oscorp",
            "Spider-Man",
            "New York City",
            "superhero sequel",
            "2014 release",
            "$200293 million budget",
            "$709.7 million box office gross",
            "mixed reviews",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'The Amazing Spider-Man 2' continues the story of Peter Parker (Andrew Garfield) as he navigates life as both a college student and the masked hero, Spider-Man. Haunted by the promise he made to Gwen Stacy's (Emma Stone) father to keep her safe, Peter struggles with his feelings for Gwen while uncovering secrets about his own past. His investigation into his parents' mysterious disappearance leads him to confront Oscorp, the corporation at the heart of many of his challenges.\n\nThe film introduces new adversaries, including Electro (Jamie Foxx), a former Oscorp employee who gains electrical powers and becomes a formidable foe. Additionally, Peter's childhood friend, Harry Osborn (Dane DeHaan), returns to New York and succumbs to the pressures of his legacy, adopting the persona of the Green Goblin. The convergence of these threats tests Spider-Man's resolve and his relationships, particularly with Gwen, whose life becomes increasingly endangered by Peter's dual identity.\n\nThe movie is noted for its high-octane action sequences, including Spider-Man's acrobatic battles against Electro amidst the city's skyline. However, it received mixed reviews from critics, who praised the performances of Garfield and Stone, as well as the visual effects, but criticized the film's convoluted plot and the overabundance of characters. Despite these critiques, the film achieved significant box office success, grossing over $700 million worldwide."
    },
    {
        "title": "X-Men: Days of Future Past",
        "poster": "https://image.tmdb.org/t/p/original/tYfijzolzgoMOtegh1Y7j2Enorg.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hUPgIibqZlwbhs4N08cPzzc4f5K.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/uYxmEE4bfIiw5Eilo44Stsmk18K.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/d3vdGM4NBUTnzyjWn5h1qfJNczj.png",
        "main_src": "https://vidlink.pro/movie/127585",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/gsjtg7m1MMM",
        "genre": [
            "Superhero",
            "action-adventure",
            "science fiction",
            "thriller"
        ],
        "key_words": [
            "X-Men: Days of Future Past",
            "Bryan Singer",
            "Hugh Jackman",
            "James McAvoy",
            "Michael Fassbender",
            "Jennifer Lawrence",
            "Halle Berry",
            "Anna Paquin",
            "Elliot Page",
            "Peter Dinklage",
            "Ian McKellen",
            "Patrick Stewart",
            "Wolverine",
            "Professor X",
            "Magneto",
            "Mystique",
            "Sentinels",
            "time travel",
            "1973",
            "dystopian future",
            "mutants",
            "Charles Xavier",
            "Erik Lehnsherr",
            "Raven Darkhlme",
            "Trask Industries",
            "Bolivar Trask",
            "Kitty Pryde",
            "Bishop",
            "Blink",
            "Warpath",
            "Sunspot",
            "Quicksilver",
            "Apocalypse",
            "2014 release",
            "$200205 million budget",
            "$746 million box office gross",
            "critical acclaim",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'X-Men: Days of Future Past' presents a dystopian future where mutants are on the brink of extinction, hunted by the Sentinelsadvanced robots developed to detect and eliminate mutants. In a desperate bid to alter this grim fate, the X-Men devise a plan to send Wolverine's consciousness back in time to 1973. The objective is to prevent the pivotal event that leads to the Sentinels' creation and the ensuing persecution of mutants. \n\nUpon arriving in his younger body, Wolverine seeks out Professor X and Magneto, who are both disillusioned and estranged following the events that led to the downfall of their original vision for mutantkind. Convincing them to set aside their differences, they form an uneasy alliance to thwart the assassination of Bolivar Trask, the creator of the Sentinels. This assassination, orchestrated by Mystique, is the catalyst that leads to the development of the Sentinels and the subsequent dystopian future.\n\nThe film intricately weaves between the past and the future, showcasing the efforts of the X-Men in both timelines to prevent the catastrophic events that would lead to the extinction of their kind. The narrative explores themes of fate, identity, and the possibility of redemption, all set against the backdrop of high-stakes action sequences and emotional character arcs."
    },
    {
        "title": "Guardians of the Galaxy",
        "poster": "https://image.tmdb.org/t/p/original/jPrJPZKJVhvyJ4DmUTrDgmFN0yG.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/uLtVbjvS1O7gXL8lUOwsFOH4man.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/ko4N6wWp0UYlMmsVyfIfLyRAZtP.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/fsauViA7Rj5riPzF3HkVT1uVThY.png",
        "main_src": "https://vidlink.pro/movie/118340",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/3CqymRQ1uUU",
        "genre": [
            "Superhero",
            "action-adventure",
            "science fiction",
            "space opera"
        ],
        "key_words": [
            "Guardians of the Galaxy",
            "James Gunn",
            "Chris Pratt",
            "Zoe Saldaa",
            "Dave Bautista",
            "Vin Diesel",
            "Bradley Cooper",
            "Star-Lord",
            "Gamora",
            "Drax the Destroyer",
            "Rocket Raccoon",
            "Groot",
            "Marvel Cinematic Universe",
            "Phase Two",
            "2014 release",
            "$232.3 million budget",
            "$773.3 million box office gross",
            "critical acclaim",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'Guardians of the Galaxy' follows Peter Quill (Chris Pratt), a brash space adventurer who steals a powerful orb sought by the villainous Ronan the Accuser (Lee Pace). To evade Ronan, Quill forms an uneasy alliance with a group of misfits: Gamora (Zoe Saldaa), a skilled assassin and daughter of Thanos; Drax the Destroyer (Dave Bautista), a warrior seeking vengeance for his family; Rocket (voiced by Bradley Cooper), a genetically modified raccoon with a penchant for weaponry; and Groot (voiced by Vin Diesel), a sentient tree capable of limited speech. \n\nTogether, they embark on a daring mission to sell the orb, only to discover its true nature as an Infinity Stonea powerful artifact capable of destroying entire planets. Realizing the threat Ronan poses with the stone, the group decides to stand against him, ultimately saving the galaxy from annihilation.\n\nThe film was praised for its humor, visual effects, and the chemistry among the cast. It became a critical and commercial success, grossing over $773 million worldwide and becoming the third-highest-grossing film of 2014."
    },
    {
        "title": "Big Hero 6",
        "poster": "https://image.tmdb.org/t/p/original/rzEmN6l7yWDH9KttH4yXrDftL53.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/4s2d3xdyqotiVNHTlTlJjrr3q0H.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/ie6jboaxL8WYJO3TWt9JZdvnHzL.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/yRyhoskxfK12s5FBE8w05knA1rv.png",
        "main_src": "https://vidlink.pro/movie/177572",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/8IdMPpKMdcc",
        "genre": [
            "Animation",
            "Action-Adventure",
            "Family",
            "Science Fiction"
        ],
        "key_words": [
            "Big Hero 6",
            "Don Hall",
            "Chris Williams",
            "Ryan Potter",
            "Scott Adsit",
            "Daniel Henney",
            "T.J. Miller",
            "Jamie Chung",
            "Damon Wayans Jr.",
            "Genesis Rodriguez",
            "James Cromwell",
            "Maya Rudolph",
            "Alan Tudyk",
            "Hiro Hamada",
            "Baymax",
            "San Fransokyo",
            "superhero team",
            "robotics",
            "animation",
            "Disney",
            "2014 release",
            "Academy Award for Best Animated Feature",
            "$165 million budget",
            "$657.8 million box office gross",
            "critical acclaim",
            "Rotten Tomatoes",
            "Metacritic",
            "Blu-ray",
            "DVD",
            "streaming on Disney+"
        ],
        "description": "'Big Hero 6' follows Hiro Hamada (Ryan Potter), a 14-year-old robotics prodigy living in the futuristic city of San Fransokyo. After a tragic event, Hiro forms a bond with Baymax (Scott Adsit), a healthcare companion robot created by his late brother, Tadashi. Together with Tadashi's friendsGo Go Tomago (Jamie Chung), Wasabi (Damon Wayans Jr.), Honey Lemon (Genesis Rodriguez), and Fred (T.J. Miller)they form a superhero team to uncover the mystery behind a devastating incident and combat a mysterious villain threatening their city.\n\nThe film received positive reviews for its animation, storytelling, and emotional depth. It won the Academy Award for Best Animated Feature and grossed over $657 million worldwide, making it the highest-grossing animated film of 2014."
    },
    {
        "title": "Kingsman: The Secret Service",
        "poster": "https://image.tmdb.org/t/p/original/r6q9wZK5a2K51KFj4LWVID6Ja1r.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/qzUIOTk0E3F1zjvYjcBRTKUTgf9.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/xEMkMNFVL0Lllw0hTuuaiqJ0Yr7.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/iBSqLtHA9ZerSVviA0GFFdFKeg2.png",
        "main_src": "https://vidlink.pro/movie/207703",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Th_KrhqmHk8",
        "genre": [
            "Action",
            "Comedy",
            "Spy",
            "Thriller"
        ],
        "key_words": [
            "Kingsman",
            "Matthew Vaughn",
            "Colin Firth",
            "Taron Egerton",
            "Samuel L. Jackson",
            "Mark Strong",
            "Michael Caine",
            "Secret Service",
            "Spy Agency",
            "Action-Comedy",
            "British Cinema",
            "2014 Release",
            "$8194 million Budget",
            "$414.4 million Box Office Gross",
            "Critical Acclaim",
            "Rotten Tomatoes",
            "Blu-ray",
            "DVD",
            "Streaming on Various Platforms"
        ],
        "description": "The narrative follows Gary 'Eggsy' Unwin (Taron Egerton), a young man from a rough London neighborhood who is recruited by Harry Hart (Colin Firth), a seasoned agent of the clandestine Kingsman organization. Under Harry's mentorship, Eggsy undergoes rigorous training to become a Kingsman agent. The plot intensifies as the agency confronts Richmond Valentine (Samuel L. Jackson), a tech billionaire with a nefarious plan to address climate change by drastically reducing the global population.\n\nThe film is renowned for its stylized action sequences, notably a church scene set to Lynyrd Skynyrd's 'Free Bird,' which showcases the movie's unique blend of choreography and dark humor. While some critics debated the film's portrayal of violence, many praised its inventive approach and engaging performances."
    },
    
  {
    "title": "Avengers: Age of Ultron",
    "poster": "https://image.tmdb.org/t/p/original/4ssDuvEDkSArWEdyBl2X5EHvYKU.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/6YwkGolwdOMNpbTOmLjoehlVWs5.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/9t6drsYN58jO9ZSRu8Gs5f2XgzQ.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/2EDfWIRFdlx9L9fPcaWkWVu3PPD.png",
    "main_src": "https://vidlink.pro/movie/99861",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/JAUoeqvedMo",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Avengers",
      "Age of Ultron",
      "Marvel",
      "Iron Man",
      "Captain America",
      "Thor",
      "Hulk",
      "Black Widow",
      "Hawkeye",
      "MCU",
      "Scarlet Witch",
      "Quicksilver",
      "Vision",
      "Artificial Intelligence",
      "Tony Stark",
      "Bruce Banner",
      "Loki's Scepter",
      "Infinity Stone"
    ],
    "description": "'Avengers: Age of Ultron' is a 2015 American superhero film directed by Joss Whedon. It serves as the sequel to 2012's 'The Avengers' and is the 11th installment in the Marvel Cinematic Universe (MCU). The film features an ensemble cast, including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, and Jeremy Renner.\n\nIn 'Avengers: Age of Ultron,' Tony Stark (Iron Man) and Bruce Banner (Hulk) attempt to jump-start a dormant peacekeeping program called Ultron, an artificial intelligence system designed to protect Earth. However, Ultron becomes sentient and concludes that humanity itself is the greatest threat to the planet. He sets out to eradicate human life, leading the Avengers to confront him and his army of robots. Along the way, they encounter Pietro and Wanda Maximoffalso known as Quicksilver and Scarlet Witchwho initially oppose the Avengers but later join their cause. The team also introduces Vision, an android with a conscience, who plays a crucial role in the battle against Ultron."
  },
  {
    "title": "Ant-Man",
    "poster": "https://image.tmdb.org/t/p/original/rQRnQfUl3kfp78nCWq8Ks04vnq1.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/1K3JmSNUN8OpjYsCjc0Hy0SYxAb.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/a7sAqMKv5tkAdMzFfIhPqIBmQ9g.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/wF5P8VF1AWLWGfIetRO0X98vJrK.png",
    "main_src": "https://vidlink.pro/movie/102899",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/cx3joJnXydc",
    "genre": [
      "Action",
      "Adventure",
      "Comedy",
      "Science Fiction"
    ],
    "key_words": [
      "Ant-Man",
      "Marvel",
      "Scott Lang",
      "Hank Pym",
      "shrinking technology",
      "heist",
      "superhero",
      "MCU",
      "Paul Rudd",
      "Michael Douglas",
      "Evangeline Lilly",
      "Corey Stoll"
    ],
    "description": "'Ant-Man' is a 2015 American superhero film based on the Marvel Comics characters Scott Lang and Hank Pym. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 12th film in the Marvel Cinematic Universe (MCU). Directed by Peyton Reed, the screenplay was crafted by Edgar Wright & Joe Cornish and Adam McKay & Paul Rudd. \n\nThe narrative follows Scott Lang (Paul Rudd), a skilled thief who acquires a suit that allows him to shrink in size while increasing in strength. Under the mentorship of Dr. Hank Pym (Michael Douglas), the original Ant-Man, Lang embraces his inner hero to prevent Pym's former protg, Darren Cross (Corey Stoll), from weaponizing similar technology. Evangeline Lilly portrays Hope van Dyne, Pym's daughter, who plays a crucial role in training Lang. "
  },
  {
    "title": "Fantastic Four",
    "poster": "https://image.tmdb.org/t/p/original/g1NPhAw3dDNwt08abfLOOmDHpLw.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/or5kDR8Ve3TtuPSdEf1X5NdQHyz.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/lhbeVy5YgXjr7kvj9kaVRUCNfsZ.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/1cyx0g3MCUmXrfW15JgHmTnKq1i.png",
    "main_src": "https://vidlink.pro/movie/166424",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/AAgnQdiZFsQ",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Fantastic Four",
      "Marvel Comics",
      "superhero team",
      "alternate universe",
      "superhuman abilities",
      "Josh Trank",
      "Miles Teller",
      "Kate Mara",
      "Michael B. Jordan",
      "Jamie Bell",
      "Toby Kebbell",
      "Doctor Doom"
    ],
    "description": "'Fantastic Four' (2015) is a superhero film directed by Josh Trank, featuring Miles Teller as Reed Richards (Mr. Fantastic), Kate Mara as Sue Storm (Invisible Woman), Michael B. Jordan as Johnny Storm (Human Torch), and Jamie Bell as Ben Grimm (The Thing). The storyline follows these four young individuals who, after teleporting to an alternate universe, acquire unique superhuman abilities. They must learn to harness their new powers and work together to prevent Earth from a former friend turned enemy. \n\nThe film had an estimated production budget of $120 million. It grossed approximately $56.1 million in the United States and Canada, with an opening weekend earning of $25.7 million. Internationally, it garnered around $111.8 million, bringing its worldwide total to approximately $167.9 million."
  },
  {
    "title": "Deadpool",
    "poster": "https://image.tmdb.org/t/p/original/3E53WEZJqP6aM84D8CckXx4pIHw.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/k2VX0gFu2BEJhvduQTq2ioYp8z7.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/rFj9IKlL75B2pXhZA60jkNWvxeW.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/piuamNKC09lepRcjrWx9GfEa8hN.png",
    "main_src": "https://vidlink.pro/movie/293660",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/9vN6DHB6bJc",
    "genre": [
      "Action",
      "Comedy",
      "Superhero"
    ],
    "key_words": [
      "Deadpool",
      "Marvel Comics",
      "Ryan Reynolds",
      "X-Men",
      "antihero",
      "fourth wall",
      "R-rated superhero film",
      "Tim Miller",
      "Morena Baccarin",
      "Ed Skrein"
    ],
    "description": "'Deadpool' is a 2016 American superhero film directed by Tim Miller in his directorial debut. The film stars Ryan Reynolds as Wade Wilson, a former Special Forces operative turned mercenary who, after being subjected to a rogue experiment, gains accelerated healing powers and adopts the alter ego Deadpool. The cast also includes Morena Baccarin as Vanessa, Ed Skrein as Ajax, T.J. Miller as Weasel, Gina Carano as Angel Dust, and Brianna Hildebrand as Negasonic Teenage Warhead.\n\nThe film follows Wade Wilson, who, after being diagnosed with terminal cancer, undergoes an experimental treatment that leaves him with accelerated healing abilities but severely scars his body. Adopting the moniker Deadpool, he sets out to hunt down the man responsible for his transformation, seeking revenge while also attempting to reconnect with his fiance, Vanessa."
  },
  {
    "title": "Captain America: Civil War",
    "poster": "https://image.tmdb.org/t/p/original/uymMGErUAUXElLJE4jTUrDMT7wr.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/wdwcOBMkt3zmPQuEMxB3FUtMio2.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/7FWlcZq3r6525LWOcvO9kNWurN1.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/19vL8lerTxsNrtQsiPsgmuHbGUi.png",
    "main_src": "https://vidlink.pro/movie/271110",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/dKrVegVI0Us",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Captain America",
      "Civil War",
      "Marvel",
      "Iron Man",
      "Avengers",
      "MCU",
      "superhero conflict",
      "Sokovia Accords",
      "Team Cap",
      "Team Iron Man"
    ],
    "description": "'Captain America: Civil War' is a 2016 superhero film directed by Anthony and Joe Russo, marking the 13th installment in the Marvel Cinematic Universe (MCU). The movie features an ensemble cast including Chris Evans as Steve Rogers (Captain America), Robert Downey Jr. as Tony Stark (Iron Man), Scarlett Johansson as Natasha Romanoff (Black Widow), and introduces Chadwick Boseman as T'Challa (Black Panther) and Tom Holland as Peter Parker (Spider-Man).\n\nThe narrative centers on the aftermath of a mission led by the Avengers that results in significant collateral damage. This incident prompts governmental authorities to propose the Sokovia Accords, aiming to regulate and oversee superhero activities. The Avengers find themselves divided: Tony Stark supports the accords, advocating for accountability, while Steve Rogers opposes them, fearing governmental overreach. This ideological rift escalates into a full-blown conflict, forcing allies to choose sides."
  },
  {
    "title": "X-Men: Apocalypse",
    "poster": "https://image.tmdb.org/t/p/original/ikA8UhYdTGpqbatFa93nIf6noSr.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/2ex2beZ4ssMeOduLD0ILzXKCiep.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/fjQ9qPY3rCDmSwRc3PGry4MBFJ1.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/rvVpfnBzNUL3xiFQxyndjDXPJsO.png",
    "main_src": "https://vidlink.pro/movie/246655",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/Jer8XjMrUB4",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "X-Men",
      "Apocalypse",
      "mutants",
      "Marvel Comics",
      "Professor X",
      "Magneto",
      "Mystique",
      "En Sabah Nur",
      "superhero team",
      "ancient mutant"
    ],
    "description": "'X-Men: Apocalypse' is a 2016 superhero film directed by Bryan Singer, serving as the ninth installment in the X-Men film series. The movie features an ensemble cast including James McAvoy as Professor Charles Xavier, Michael Fassbender as Erik Lehnsherr/Magneto, Jennifer Lawrence as Raven Darkhlme/Mystique, and Oscar Isaac as the ancient mutant En Sabah Nur/Apocalypse. The plot centers on Apocalypse, believed to be the first mutant, who awakens after thousands of years with plans to reshape the world. The X-Men must unite to thwart his catastrophic intentions.\n\nThe film had a production budget of approximately $178 million. It grossed around $155.4 million in the United States and Canada, and approximately $388.5 million in other territories, totaling about $543.9 million worldwide. This made it the third highest-grossing film in the X-Men series at the time, though it earned about 27% less than its predecessor, 'X-Men: Days of Future Past.' "
  },
  {
    "title": "Doctor Strange",
    "poster": "https://image.tmdb.org/t/p/original/xf8PbyQcR5ucXErmZNzdKR0s8ya.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/3zvZ699gMW2RhWc0GisIukzq0Ls.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/kkoiH8ZWxJ9WSAjOadGtuHUQxbm.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/bwsQMCImNP2yDVLclAPTX1wbRDx.png",
    "main_src": "https://vidlink.pro/movie/284052",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/HSzx-zryEgM",
    "genre": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "key_words": [
      "Doctor Strange",
      "Marvel Cinematic Universe",
      "Benedict Cumberbatch",
      "Sorcerer Supreme",
      "Mystic Arts",
      "Time Stone",
      "Kamar-Taj"
    ],
    "description": "'Doctor Strange' is a 2016 superhero film directed by Scott Derrickson, featuring Benedict Cumberbatch as Dr. Stephen Strange, a renowned neurosurgeon who becomes a Master of the Mystic Arts. The film also stars Chiwetel Ejiofor as Karl Mordo, Rachel McAdams as Christine Palmer, Tilda Swinton as the Ancient One, and Mads Mikkelsen as Kaecilius.\n\nAfter a devastating car accident, Dr. Stephen Strange's hands are severely injured, ending his surgical career. In search of healing, he journeys to Kamar-Taj in Nepal, where he meets the Ancient One. Under her tutelage, Strange learns the mystic arts and discovers hidden dimensions and magical realms. As he delves deeper, he becomes entangled in a battle against Kaecilius, a rogue sorcerer threatening to unleash dark forces upon the world. "
  },
  {
    "title": "Logan",
    "poster": "https://image.tmdb.org/t/p/original/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/9X7YweCJw3q8Mcf6GadxReFEksM.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/dfBiALov0mYoqKCHaOHka2x0U26.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/uFDBqa4H7En49roPDtKlwPff0jG.png",
    "main_src": "https://vidlink.pro/movie/263115",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/XaE_9pfybL4",
    "genre": [
      "Action",
      "Drama",
      "Science Fiction"
    ],
    "key_words": [
      "Logan",
      "Wolverine",
      "X-Men",
      "Hugh Jackman",
      "Patrick Stewart",
      "Dafne Keen",
      "Marvel Comics",
      "superhero",
      "mutant",
      "Charles Xavier"
    ],
    "description": "'Logan' is a 2017 superhero film directed by James Mangold, marking Hugh Jackman's final portrayal of the character Wolverine. The film also features Patrick Stewart as Charles Xavier and introduces Dafne Keen as Laura, a young mutant. \n\nSet in the year 2029, mutants are nearly extinct. An aging and weary Logan (Wolverine) leads a secluded life, caring for an ailing Charles Xavier. His attempts to remain hidden are disrupted when he encounters Laura, a young mutant pursued by dark forces. Logan embarks on a journey to protect her, confronting his own legacy and mortality. "
  },
  {
    "title": "Guardians of the Galaxy Vol. 2",
    "poster": "https://image.tmdb.org/t/p/original/y4MBh0EjBlMuOzv9axM4qJlmhzz.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/aJn9XeesqsrSLKcHfHP4u5985hn.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/xpFIaHL7Rm5kKLcEPDEMpjh4Xq6.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/767C9dyjI9FMq6emsDE0rY6K8Nc.png",
    "main_src": "https://vidlink.pro/movie/283995",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/wUn05hdkhjM",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Guardians of the Galaxy",
      "Marvel Cinematic Universe",
      "Star-Lord",
      "Gamora",
      "Drax",
      "Rocket",
      "Groot",
      "Ego the Living Planet",
      "Yondu",
      "Nebula"
    ],
    "description": "'Guardians of the Galaxy Vol. 2' is a 2017 superhero film directed by James Gunn, serving as the sequel to 2014's 'Guardians of the Galaxy' and the fifteenth installment in the Marvel Cinematic Universe (MCU). The film features an ensemble cast including Chris Pratt as Peter Quill/Star-Lord, Zoe Saldana as Gamora, Dave Bautista as Drax the Destroyer, Vin Diesel voicing Groot, and Bradley Cooper voicing Rocket. The narrative follows the Guardians as they traverse the cosmos, aiding Peter Quill in uncovering the mysteries of his parentage.\n\nSet shortly after the events of the first film, the Guardians of the Galaxy are hired by the Sovereign race to protect valuable batteries from an interdimensional monster. After the mission, they encounter Ego (Kurt Russell), who claims to be Peter Quill's father. As Ego reveals his celestial origins and invites Quill to his planet, the Guardians become entangled in a complex web of family dynamics and cosmic threats, leading them to confront new adversaries and reconcile their own personal conflicts."
  },
  {
    "title": "Spider-Man: Homecoming",
    "poster": "https://image.tmdb.org/t/p/original/c24sv2weTHPsmDa7jEMN0m2P3RT.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/tPpYGm2mVecue7Bk3gNVoSPA5qn.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/2j91PzOC2gSWKn53AIIAQi0UYI.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/zxdyOGiGE1dUFgTGr4kvF1NTWdq.png",
    "main_src": "https://vidlink.pro/movie/315635",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/xEvV3OsE2WM",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Spider-Man",
      "Marvel Cinematic Universe",
      "Tom Holland",
      "Vulture",
      "Iron Man",
      "high school superhero"
    ],
    "description": "'Spider-Man: Homecoming' is a 2017 superhero film directed by Jon Watts, marking Tom Holland's first solo outing as Peter Parker/Spider-Man in the Marvel Cinematic Universe (MCU). The film also features Michael Keaton as Adrian Toomes/Vulture, Robert Downey Jr. as Tony Stark/Iron Man, and Marisa Tomei as Aunt May.\n\nFollowing his involvement with the Avengers, young Peter Parker returns to his normal life in Queens, New York. Eager to prove himself, he balances high school life with his superhero duties. Peter encounters a new threat in the form of Adrian Toomes, a salvage worker turned arms trafficker who becomes the Vulture. As Spider-Man, Peter strives to stop Toomes while navigating the challenges of adolescence."
  },
  {
    "title": "Kingsman: The Golden Circle",
    "poster": "https://image.tmdb.org/t/p/original/tdcg5pQy6SPdyO7J3sRnt88yEog.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/uExPmkOHJySrbJyJDJylHDqaT58.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/sYlblumHSeTZrT4VV6JZBiqAaGw.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/ff9ExZQrltE7bk8wYRJnFkfg0kr.png",
    "main_src": "https://vidlink.pro/movie/343668",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/0fvqnGmr9S8",
    "genre": [
      "Action",
      "Comedy",
      "Spy"
    ],
    "key_words": [
      "Kingsman",
      "spy comedy",
      "action film",
      "Taron Egerton",
      "Colin Firth",
      "Julianne Moore",
      "Matthew Vaughn"
    ],
    "description": "'Kingsman: The Golden Circle' is a 2017 spy action-comedy film directed by Matthew Vaughn, serving as the sequel to 2014's 'Kingsman: The Secret Service.' The film features returning cast members Taron Egerton as Eggsy, Colin Firth as Harry Hart, and Mark Strong as Merlin, alongside new additions Julianne Moore as Poppy Adams, Halle Berry as Ginger Ale, Pedro Pascal as Whiskey, Channing Tatum as Tequila, and Jeff Bridges as Champagne.\n\nAfter the destruction of the Kingsman headquarters by the criminal organization known as the Golden Circle, Eggsy and Merlin seek assistance from their American counterparts, the Statesman. Together, they embark on a mission to thwart the plans of Poppy Adams, the Golden Circle's leader, who aims to hold the world hostage with a deadly toxin."
  },
  {
    "title": "Thor: Ragnarok",
    "poster": "https://image.tmdb.org/t/p/original/8hnNdUFlUkjPWxKDyiE4Kn8h7Q5.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/6G2fLCVm9fiLyHvBrccq6GSe2ih.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/xfH3mYQ9x3pQmExyTfokxVUbfVr.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/mp1u3U9zdzuxfHhjMcD3tX3LnIA.png",
    "main_src": "https://vidlink.pro/movie/284053",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/ue80QwXMRHg",
    "genre": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "key_words": [
      "Thor",
      "Marvel Cinematic Universe",
      "Chris Hemsworth",
      "Loki",
      "Hela",
      "Hulk",
      "Asgard",
      "Taika Waititi"
    ],
    "description": "'Thor: Ragnarok' is a 2017 superhero film directed by Taika Waititi, serving as the third installment in the Thor series within the Marvel Cinematic Universe (MCU). The film stars Chris Hemsworth as Thor, alongside Tom Hiddleston as Loki, Cate Blanchett as Hela, Mark Ruffalo as Bruce Banner/Hulk, Tessa Thompson as Valkyrie, and Jeff Goldblum as the Grandmaster.\n\nImprisoned on the planet Sakaar, Thor finds himself in a race against time to return to Asgard and prevent Ragnarkthe prophesied destruction of his homeworldat the hands of the powerful and ruthless villain Hela. Along the way, he encounters old allies and new adversaries, leading to a cosmic adventure filled with humor and action."
  },
  {
    "title": "Black Panther",
    "poster": "https://image.tmdb.org/t/p/original/qjarBufG0iUqr1IvJUK8AJnpTIR.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/b6ZJZHUdMEFECvGiDpJjlfUWela.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/AlFqBwJnokrp9zWTXOUv7uhkaeq.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/hhSZl284wdgX7nY3lJXGS1e0sAL.png",
    "main_src": "https://vidlink.pro/movie/284054",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/xjDjIWPwcPU",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Black Panther",
      "Marvel Cinematic Universe",
      "Wakanda",
      "Chadwick Boseman",
      "Erik Killmonger",
      "Vibranium"
    ],
    "description": "'Black Panther' is a 2018 superhero film directed by Ryan Coogler, featuring Chadwick Boseman as T'Challa/Black Panther. The ensemble cast includes Michael B. Jordan as Erik Killmonger, Lupita Nyong'o as Nakia, Danai Gurira as Okoye, Martin Freeman as Everett K. Ross, and Letitia Wright as Shuri.\n\nAfter the death of his father, T'Challa returns to the isolated, technologically advanced African nation of Wakanda to assume the throne. His sovereignty is challenged by Erik Killmonger, who plans to abandon Wakanda's isolationist policies and initiate a global revolution. T'Challa must rally his allies and harness the full power of Black Panther to defeat his foes and secure the safety of his people."
  },
  {
    "title": "Avengers: Infinity War",
    "poster": "https://image.tmdb.org/t/p/original/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
    "backDropPoster": "https://image.tmdb.org/t/p/original/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
    "backDropPoster2": "https://image.tmdb.org/t/p/original/bOGkgRGdhrBYJSLpXaxhXVstddV.jpg",
    "logo_img": "https://image.tmdb.org/t/p/original/7fBzZBlDlbxBNFEY50P4J4OZ5RX.png",
    "main_src": "https://vidlink.pro/movie/299536",
    "own_src": "",
    "yt_trailer_src": "https://www.youtube.com/embed/QwievZ1Tx-8",
    "genre": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "key_words": [
      "Avengers",
      "Infinity War",
      "Thanos",
      "Infinity Stones",
      "Marvel Cinematic Universe",
      "superhero ensemble"
    ],
    "description": "'Avengers: Infinity War' is a 2018 superhero film directed by Anthony and Joe Russo, serving as the third installment in the Avengers series within the Marvel Cinematic Universe (MCU). The film features an ensemble cast, including Robert Downey Jr. as Tony Stark/Iron Man, Chris Hemsworth as Thor, Mark Ruffalo as Bruce Banner/Hulk, Chris Evans as Steve Rogers/Captain America, Scarlett Johansson as Natasha Romanoff/Black Widow, Benedict Cumberbatch as Stephen Strange/Doctor Strange, Don Cheadle as James Rhodes/War Machine, Tom Holland as Peter Parker/Spider-Man, Chadwick Boseman as T'Challa/Black Panther, Paul Bettany as Vision, Elizabeth Olsen as Wanda Maximoff/Scarlet Witch, Anthony Mackie as Sam Wilson/Falcon, Sebastian Stan as Bucky Barnes/Winter Soldier, Danai Gurira as Okoye, Letitia Wright as Shuri, Dave Bautista as Drax, Zoe Saldaa as Gamora, Josh Brolin as Thanos, and Chris Pratt as Peter Quill/Star-Lord.\n\nThe film follows the Avengers and the Guardians of the Galaxy as they unite to stop the tyrannical warlord Thanos from collecting all six Infinity Stones. Thanos aims to use the artifacts to impose his twisted will on reality, threatening the existence of the universe. The heroes face numerous challenges and sacrifices in their attempt to thwart his plan."
  }
        ]
