[
    {
        "title": "Mufasa: The Lion King",
        "poster": "https://image.tmdb.org/t/p/original/jbOSUAWMGzGL1L4EaUF8K6zYFo7.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/cVh8Af7a9JMOJl75ML3Dg2QVEuq.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/1w8kutrRucTd3wlYyu5QlUDMiG1.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/bQFYVhFnshXIQHmMKDX3FsP77tP.png",
        "main_src": "https://hdstream4u.com/embed/z79o0gekbt0w",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/arxGBPMmsFU",
        "genre": [
            "Animation",
            "Adventure",
            "Drama",
            "Fantasy",
            "Musical",
            "Family"
        ],
        "key_words": [
            "Mufasa The Lion King",
            "2024"
        ],
        "description": "Mufasa: The Lion King is a 2024 American musical drama film directed by Barry Jenkins. Serving as both a prequel and sequel to the 2019 adaptation of The Lion King, the film explores the origins of Mufasa, Simba's father. The narrative unfolds through flashbacks as Rafiki recounts Mufasa's journey from an orphaned cub to becoming the king, highlighting his relationship with Taka, who later becomes Scar. The film features a notable voice cast, including Aaron Pierre as Mufasa, Kelvin Harrison Jr. as Taka, and returning talents such as Seth Rogen and Billy Eichner. Upon its release on December 20, 2024, Mufasa: The Lion King received mixed reviews from critics and has grossed $717 million worldwide, making it the sixth-highest-grossing film of 2024. The film is scheduled for digital download release on February 18, 2025, with a Disney+ streaming release on March 26, 2025, and availability on 4K Ultra HD, Blu-ray, and DVD on April 1, 2025."
    },
    {
        "title": "Moana 2",
        "poster": "https://image.tmdb.org/t/p/original/720TEIkvYHUYHg1N7ShUxZmh0gu.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/vYqt6kb4lcF8wwqsMMaULkP9OEn.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/z6H78tQNcryTO4sgDjg8Knc6H9W.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/9BXuuOa8b9AX5NalFg5LEzPqrq0.png",
        "main_src": "https://Smoothpre.com/embed/web41b495ju6",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/hDZ7y8RP5HE",
        "genre": [
            "Animation",
            "Adventure",
            "Musical",
            "Comedy"
        ],
        "key_words": [
            "Moana",
            "2024"
        ],
        "description": "Moana 2, the sequel to Disney's 2016 animated classic, continues the adventurous journey of Moana (voiced by Auli'i Cravalho), now a celebrated wayfinder.\n\nThe film opens with Moana exploring nearby islands, seeking connections with other oceanic tribes. She experiences a vision from her ancestor, Tautai Vasa, revealing that the storm god Nalo submerged the legendary island of Motufetu, disrupting the unity among the islands.\n\nTautai warns that without restoring Motufetu, Moana's home island of Motunui faces a desolate future.\n\nDetermined to save her people, Moana assembles a diverse crew: the craftswoman Loto, historian Moni, the grumpy elder Keke, and her loyal pets, Pua the pig and Heihei the rooster. They embark on a daring voyage across the ocean, guided by a comet's path toward the hidden Motufetu. Along the way, they encounter the Kakamora, once-hostile coconut-like pirates, who reveal that Nalo's actions severed their connection to their homeland. Forming an alliance, they confront various challenges, including a gargantuan monster clam.\n\nMeanwhile, the demigod Maui (voiced by Dwayne Johnson) seeks Motufetu but is captured by Nalo's enforcer, Matangi. Despite initial reluctance to involve Moana, fearing for her safety, Maui eventually reunites with her and the crew. Together, they face Nalo's monstrous creations and a formidable storm guarding Motufetu. In a climactic battle, Maui attempts to raise the sunken island but loses his powers to Nalo. Demonstrating immense courage, Moana dives into the ocean to break the curse, succeeding but seemingly sacrificing herself. Her ancestors intervene, reviving her as a demigoddess, symbolized by new tattoos marking her ascension.\n\nWith renewed strength, Moana and Maui restore Motufetu, reuniting the scattered tribes and bringing harmony back to the oceanic world. The film concludes with a celebratory return to Motunui, where Moana's leadership and bravery are honored. A mid-credits scene hints at future adventures, as Nalo vows revenge, setting the stage for potential sequels.\n\nMoana 2 explores themes of unity, heritage, and resilience, blending Polynesian folklore with vibrant animation and musical sequences. While some critics feel it doesn't fully capture the original's magic, it offers an entertaining experience for audiences, particularly younger viewers."
    },
    {
        "title": "The Platform",
        "poster": "https://image.tmdb.org/t/p/original/iXvQnzy6JCAx1PiQEKXuTY04ZHl.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/2bthpeVFKRtZpmVmXdvVLFQN6xt.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/3tkDMNfM2YuIAJlvGO6rfIzAnfG.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/4sV39gAfXreETlzz6SBOO0ouQEV.png",
        "main_src": "https://vidsrc.in/embed/movie/619264",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/RlfooqeZcdY",
        "genre": [
            "Dystopian Sci-Fi",
            "Prison Drama",
            "Horror",
            "Mystery",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "The Platform",
            "2019"
        ],
        "description": "A mysterious place, an indescribable prison, a deep hole. An unknown number of levels. Two inmates living on each level. A descending platform containing food for all of them. An inhuman fight for survival, but also an opportunity for solidarity."
    },
    {
        "title": "The Dictator",
        "poster": "https://image.tmdb.org/t/p/original/yWEk2t1phuavJpGdc4XvPqcC7a4.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/jWq20KNbg5txb28tLxJl0yLYuxp.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/wDx8lSt6JpLfQ9uFQ7I9cHpluIs.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/21JyTVacPL2QcZlw9RWquQpbTEG.png",
        "main_src": "https://vidsrc.in/embed/movie/76493",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/cYplvwBvGA4",
        "genre": [
            "Satire",
            "Comedy"
        ],
        "key_words": [
            "The Dictator",
            "2012"
        ],
        "description": "The Republic of Wadiya is ruled by an eccentric and oppressive leader named Hafez Aladeen. Aladeen is summoned to New York to a UN assembly to address concerns about his country's nuclear weapons program, but the trip goes awry"
    },
    {
        "title": "Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
        "poster": "https://image.tmdb.org/t/p/original/kfkyALfD4G1mlBJI1lOt2QCra4i.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kt0Ku4cTQUZe4KyZiWC6HsWCbcS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/jJYOr36wS1B6EyGjLY17r9kNHHh.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/e3JAH1hVPDG2CRx6NqB6n0HLYs2.png",
        "main_src": "https://vidlink.pro/movie/496",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/vlnUa_dNsRQ",
        "genre": [
            "Dark Comedy",
            "Mockumentary",
            "Satire",
            "Comedy"
        ],
        "key_words": [
            "Borat Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
            "Borat! Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
            "2006"
        ],
        "description": "Borat Sagdiyev is a TV reporter of a popular show in Kazakhstan as Kazakhstan's sixth most famous man and a leading journalist. He is sent from his home to America by his government to make a documentary about American society and culture. Borat takes a course in New York City to understand American humor. While watching Baywatch on TV, Borat discovers how beautiful their women are in the form of C. J. Parker, who was played by actress Pamela Anderson who hails from Malibu, California. He decides to go on a cross-country road trip to California in a quest to make her his wife and take her back to his country. On his journey Borat and his producer encounter a country full of strange and wonderful Americans, real people in real chaotic situations with hysterical consequences."
    },
    {
        "title": "Borat Subsequent Moviefilm: Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan",
        "poster": "https://image.tmdb.org/t/p/original/3L1Ml5RWjFVfVq3rQENvgFymT0U.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hbrXbVoE0NuA1ORoSGGYNASagrl.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/ji7m2g3xYw2B3Z1IqTNQSldRlzT.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/coWH4YdTsk2Xouw7N0qghyOawcJ.png",
        "main_src": "https://vidlink.pro/movie/740985",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/0Rsa4U8mqkw",
        "genre": [
            "Farce",
            "Mockumentary",
            "Parody",
            "Satire",
            "Comedy"
        ],
        "key_words": [
            "Borat Subsequent Moviefilm Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan",
            "Borat Subsequent Moviefilm! Delivery of Prodigious Bribe to American Regime for Make Benefit Once Glorious Nation of Kazakhstan",
            "2020"
        ],
        "description": "Borat Subsequent Moviefilm: Delivery of Prodigious Bride to American Regime for Make Benefit Once Glorious Nation of Kazakhstan (2020) is a sequel to the cultural phenomenon that was the first film, Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006). I think it's safe to say most of us never expected this movie to happen, let alone be secretly filmed and release just a couple of months after its announcement. I also think it is safe to assume that most of us didn't think a sequel would be as good as the original. It would just be impossible to recapture the shocking satirical mockumentary that was the first one, but it's almost as shocking a sequel would be made today with all the political correctness, cancel culture, etc. that has become so prevalent in today's media. While this movie is definitely not as good as the original and some of its charm is lost since it has been already done before, and replicated, it still remains hilarious yet important."
    },
    {
        "title": "Anora",
        "poster": "https://image.tmdb.org/t/p/original/21qUerwfWNTwbGKc2ZH5rXXAnwm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kEYWal656zP5Q2Tohm91aw6orlT.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/qvyOfwTC3qdbzkqdXWSSEMHtjBZ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/e4zNwk1MWsmND5DIBvfzXEUnEjP.png",
        "main_src": "https://vidsrc.in/embed/movie/1064213",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/8m6UrWMl18M",
        "genre": [
            "Dark Comedy",
            "Raunchy Comedy",
            "Romantic Comedy",
            "Steamy Romance",
            "Comedy",
            "Drama",
            "Romance"
        ],
        "key_words": [
            "Anora",
            "2024"
        ],
        "description": "Anora, a young sex worker from Brooklyn, gets her chance at a Cinderella story when she meets and impulsively marries the son of an oligarch. Once the news reaches Russia, her fairytale is threatened as the parents set out for New York to get the marriage annulled."
    },
    {
        "title": "Captain America: Brave New World",
        "poster": "https://image.tmdb.org/t/p/original/pzIddUEMWhWzfvLI3TwxUG2wGoi.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/ywe9S1cOyIhR5yWzK7511NuQ2YX.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/qfAfE5auxsuxhxPpnETRAyTP5ff.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/fayntTIz513LPVVckksjlp4KOoX.png",
        "main_src": "https://vidsrc.in/embed/movie/822119",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/5PSzFLV-EyQ",
        "genre": [
            "Action Epic",
            "Adventure Epic",
            "Sci-Fi Epic",
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Captain America Brave New World",
            "Captain America 4",
            "2025"
        ],
        "description": "Some time after the events of The Falcon and the Winter Soldier, Sam Wilson has now fully embraced his title as the new Captain America. Now Sam is summoned to the White House as the new president Ross wants to work with him on rebuilding the Avengers. But trouble ensues when Sam's friend Isaiah Bradley uncontrollably tries to assassinate the president and is framed for the attempt. Now Sam and his partner Joaquin Torres must race against time to uncover the true culprit and foil an evil plot that unwittingly involves President Ross"
    },
    {
        "title": "The Shawshank Redemption",
        "poster": "https://image.tmdb.org/t/p/original/9cqNxx0GxF0bflZmeSMuL5tnGzr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/zfbjgQE1uSd9wiPTX4VzsLi0rGG.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gZMgEUYbh0DIBNaRJT0ofxLDJ5T.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/8pPq3gJG4oWYonbL6DaHslJeCaM.png",
        "main_src": "https://vidsrc.in/embed/movie/278",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/PLl99DlL6b4",
        "genre": [
            "Epic",
            "Period Drama",
            "Prison Drama",
            "Drama"
        ],
        "key_words": [
            "The Shawshank Redemption",
            "1994"
        ],
        "description": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red"
    },
    {
        "title": "The Godfather",
        "poster": "https://image.tmdb.org/t/p/original/3Tf8vXykYhzHdT0BtsYTp570JGQ.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/tmU7GeKVybMWFButWEGl2M4GeiP.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/90UI4bE5aSOWBf6Awf3pYjAxcva.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/f6YA8R8pd1Vd8dqZamBlDnWsIfS.svg",
        "main_src": "https://vidsrc.in/embed/movie/238",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Ew9ngL1GZvs",
        "genre": [
            "Epic",
            "Gangster",
            "Tragedy",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "The Godfather",
            "1972"
        ],
        "description": "The Godfather 'Don' Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WWII Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart."
    },
    {
        "title": "The Dark Knight",
        "poster": "https://image.tmdb.org/t/p/original/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/dqK9Hag1054tghRQSqLSfrkvQnA.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/6qYxCxggmaUy6C9SaDOq0fVym6S.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/nKJFT72I3uR0TCNFh6TksDvf3Ix.svg",
        "main_src": "https://vidsrc.in/embed/movie/155",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/_PZpmTj1Q8Q",
        "genre": [
            "Action Epic",
            "Epic",
            "Superhero",
            "Tragedy",
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "key_words": [
            "The Dark Knight",
            "2008"
        ],
        "description": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as 'The Joker' appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to 'confront everything he believes' and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes"
    },
    {
        "title": "The Godfather Part II",
        "poster": "https://image.tmdb.org/t/p/original/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/poec6RqOKY9iSiIUmfyfPfiLtvB.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/gEfwCTLbcX7jvIHLTXfVW1idZby.png",
        "main_src": "https://vidsrc.in/embed/movie/240",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/7pfqivkYUlE",
        "genre": [
            "Epic",
            "Gangster",
            "Tragedy",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "The Godfather Part II",
            "1974"
        ],
        "description": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba"
    },
    {
        "title": "12 Angry Men",
        "poster": "https://image.tmdb.org/t/p/original/ppd84D2i9W8jXmsyInGyihiSyqz.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/w4bTBXcqXc2TUyS5Fc4h67uWbPn.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/tj6iPnz18hGfr0LKqWmG6Cp3niO.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/uvXtPqfDAFEyxKCh06y0uiofK4T.png",
        "main_src": "https://vidsrc.in/embed/movie/389",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/TEN-2uTi2c0",
        "genre": [
            "Legal Drama",
            "Psychological Drama",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "12 Angry Men",
            "1957"
        ],
        "description": "The defense and the prosecution have rested, and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, AND each other. Based on the play, all of the action takes place on the stage of the jury room"
    },
    {
        "title": "The Lord of the Rings: The Return of the King",
        "poster": "https://image.tmdb.org/t/p/original/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/5JrZAtyk3LwiiAWLW0kwz41XZJC.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/2glQ9nYxjCRB27mpwNjS4pfH0RK.svg",
        "main_src": "https://vidsrc.in/embed/movie/122",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/zckJCxYxn1g",
        "genre": [
            "Action Epic",
            "Adventure Epic",
            "Epic",
            "Fantasy Epic",
            "Mountain Adventure",
            "Quest",
            "Sword & Sorcery",
            "Tragedy",
            "Adventure",
            "Drama"
        ],
        "key_words": [
            "The Lord of the Rings: The Return of the King",
            "The Lord of the Rings The Return of the King",
            "2003"
        ],
        "description": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith."
    },
    {
        "title": "Schindler's List",
        "poster": "https://image.tmdb.org/t/p/original/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/zb6fM1CX41D9rF9hdgclu0peUmy.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/3akIPnq3IYaUVy0ZgYEETR0WmBm.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/vYKiCkByWJWGVL7beyQhnvzepLG.svg",
        "main_src": "https://vidsrc.in/embed/movie/424",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/mxphAlJID9U",
        "genre": [
            "Docudrama",
            "Epic",
            "Historical Epic",
            "Period Drama",
            "Prison Drama",
            "Tragedy",
            "Biography",
            "Drama",
            "History"
        ],
        "key_words": [
            "Schindler's List",
            "1993"
        ],
        "description": "Oskar Schindler is a vain and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us."
    },
    {
        "title": "Pulp Fiction",
        "poster": "https://image.tmdb.org/t/p/original/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/52StM7zDmcjeKxWkW55X5LtoLQi.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/96hiUXEuYsu4tcnvlaY8tEMFM0m.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/dqgrq8H3ky4MxWdXyKKk8hK5E5u.png",
        "main_src": "https://vidsrc.in/embed/movie/680",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/tGpTpVyI_OQ",
        "genre": [
            "Dark Comedy",
            "Drug Crime",
            "Gangster",
            "Crime",
            "Drama"
        ],
        "key_words": [
            "Pulp Fiction",
            "1994"
        ],
        "description": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hitmen who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents."
    },
    {
        "title": "The Lord of the Rings: The Fellowship of the Ring",
        "poster": "https://image.tmdb.org/t/p/original/5m0zjctrxy9HeSAtnGWNLlsnr8z.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/x2RS3uTcsJJ9IfjNPcgDmukoEcQ.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/zzIdXP769uYxQq6rK9plfeoVdTo.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/26zlLzgXrdzxKx3eD0gl36sh9fg.png",
        "main_src": "https://vidsrc.in/embed/movie/120",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/CbYmZOV3G-Q",
        "genre": [
            "Action Epic",
            "Adventure Epic",
            "Dark Fantasy",
            "Epic",
            "Fantasy Epic",
            "Quest",
            "Sword & Sorcery",
            "Adventure",
            "Drama",
            "Fantasy"
        ],
        "key_words": [
            "The Lord of the Rings: The Fellowship of the Ring",
            "The Lord of the Rings The Fellowship of the Ring",
            "2001"
        ],
        "description": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to Mount Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign"
    },
    {
        "title": "The Good, the Bad and the Ugly",
        "poster": "https://image.tmdb.org/t/p/original/bX2xnavhMYjWDoZp1VM6VnU1xwe.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/x4biAVdPVCghBlsVIzB6NmbghIz.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/eoCSp75lxatmIa6aGqfnzwtbttd.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/lsWpgoZ5SUfmcssShExi4F1mr9Y.png",
        "main_src": "https://vidsrc.in/embed/movie/429",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/IFNUGzCOQoI",
        "genre": [
            "Adventure Epic",
            "Dark Comedy",
            "Desert Adventure",
            "Epic",
            "Period Drama",
            "Quest",
            "Spaghetti Western",
            "Western Epic",
            "Adventure",
            "Western"
        ],
        "key_words": [
            "The Good, the Bad and the Ugly",
            "The Good the Bad and the Ugly",
            "Il buono, il brutto, il cattivo",
            "Il buono il brutto il cattivo",
            "1966"
        ],
        "description": "During the American Civil War, three men set off to find $200,000.00 in buried gold coins. Tuco and Blondie have known each other for some time, having used the reward on Tuco's head as a way of earning money. They come across a dying man, Bill Carson, who tells them of a treasure in gold coins. By chance, he reveals the name of the cemetery and the name of the grave where the gold is buried. Now rivals, the two men have good reason to keep each other alive. The third man, Angel Eyes, hears of the gold stash from someone he's been hired to kill. All he knows is to look for someone named Bill Carson. The three ultimately meet in a showdown that takes place amid a major battle between Confederate and Union forces"
    },
    {
        "title": "Girls Will Be Girls",
        "poster": "https://image.tmdb.org/t/p/original/psklilaTgyczbHidamDlpFWodb0.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/6YO8KUBFuH2fReUrAFmASoqQPjj.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/2OaiuqtBygADbqiUQmqq1c1S2gg.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/3tltAXiPm6J7lZd7k0y16zZkWke.png",
        "main_src": "https://vidsrc.in/embed/movie/1108828",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/cJqnhaBZtfs",
        "genre": [
            "Coming-of-Age",
            "Drama",
            "Romance"
        ],
        "key_words": [
            "Girls Will Be Girls",
            "2024"
        ],
        "description": "Mira is the senior school student and has plenty of stuff going on in her life. She has to concentrate on her studies to get good grades, balance her relationship with her strict mother, cope with personal problems of adolescence and deal with her attraction to a boy student."
    },
    {
        "title": "Frankenstein",
        "poster": "https://image.tmdb.org/t/p/original/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hZ9f2corJKDz0mp1RD6E7zBOsa0.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/8FHmMH4mTkSTypqI70lxY14da2c.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/tH8KX7cJRriyFsWZkVZwPieU0A8.png",
        "main_src": "https://vidsrc.in/embed/movie/3035",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/ctoOmIWr2vg",
        "genre": [
            "Body Horror",
            "Monster Horror",
            "Tragedy",
            "Drama",
            "Horror",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "Frankenstein 1931",
            "Frankenstein",
            "1931"
        ],
        "description": "The 1931 horror movie 'Frankenstein', tells the tale of when Henry Frankenstein who is a doctor, trying to discover a way to make a living human using human body parts from the recently deceased. He succeeds, but his creation is looked upon as a monster by the local inhabitants, who wish to destroy it."
    },
    {
        "title": "Captain America",
        "poster": "https://image.tmdb.org/t/p/original/nBRcChS66NohR3x6KVYMp6Obutt.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hKVwvPUwMXcVqTJXOkPXUTQ7GMU.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/hKVwvPUwMXcVqTJXOkPXUTQ7GMU.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/uGcDdDazrNqZVu3EgQTnSyir1KI.png",
        "main_src": "https://vidsrc.in/embed/movie/106355",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Q7GtCsXn1yE",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "Captain America 1944",
            "Captain America",
            "1944"
        ],
        "description": "Superhero Captain America battles the evil forces of the archvillain called The Scarab, who poisons his enemies and steals a secret device capable of destroying buildings by sound vibrations."
    },
    {
        "title": "Red Sonja",
        "poster": "https://image.tmdb.org/t/p/original/qYJFrmSjy0HpzmvnIuGpuFUzXbs.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/iWFnany1vDQ4EoBgvm7E3Pb0RyS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/AcjyuOHcS4LUn9RhIUGivuWgWjF.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/kQOfuMQq6jq6SA3blWZYwgX9ooP.png",
        "main_src": "https://vidsrc.in/embed/movie/9626",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/LWfEL_zAA78",
        "genre": [
            "Sword & Sorcery",
            "Action",
            "Adventure",
            "Fantasy"
        ],
        "key_words": [
            "Red Sonja",
            "Red Sonja 1985",
            "1985"
        ],
        "description": "The tyrant Gedren seeks the total power in a world of barbarism. She attacks and kills the keepers of a powerful talisman just before it is destroyed. Gedren then uses the power of the talisman in her raid of the city Hablac. Red Sonja, sister of the keeper, sets out with her magic sword to overthrow Gedren. The talisman's master Kalidor follows to protect her. Of course they fall in love - however Red Sonja's power bases on the oath to never give herself to any man..."
    },
    {
        "title": "Howard the Duck",
        "poster": "https://image.tmdb.org/t/p/original/eU0dWo8PJgsSAZFbcyHiUpuLSyW.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/3KQe8Vzma7ZAYE25mJjgIG4Gj5e.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/a60QDTbISwyMWauftHmCLiN7GLc.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/5AM4R0tEecwGnC527CpQtxNGGvo.png",
        "main_src": "https://vidsrc.in/embed/movie/10658",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/ll6HwvEiVK4",
        "genre": [
            "Alien Invasion",
            "Dark Comedy",
            "Superhero",
            "Action",
            "Adventure",
            "Comedy",
            "Romance",
            "Sci-Fi"
        ],
        "key_words": [
            "Howard the Duck 1986",
            "Howard the Duck",
            "1986"
        ],
        "description": "A scientific experiment unknowingly brings extraterrestrial life forms to the Earth through a laser beam. First is the cigar smoking drake Howard from the duck's planet. A few kids try to keep him from the greedy scientists and help him back to his planet. But then a much less friendly being arrives through the beam..."
    },
    {
        "title": "Men in Black",
        "poster": "https://image.tmdb.org/t/p/original/uLOmOF5IzWoyrgIF5MfUnh5pa1X.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/1GJvBE7UWU1WOVi0XREl4JQc7f8.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/kMHtwjPa9bFqqbTL1HFEt8kdlnL.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/47QgpHR9fWmCJLL7BHccTBPckeL.png",
        "main_src": "https://vidsrc.in/embed/movie/607",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/HYUd7AOw_lk",
        "genre": [
            "Alien Invasion",
            "Buddy Comedy",
            "Buddy Cop",
            "High-Concept Comedy",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Comedy",
            "Sci-Fi"
        ],
        "key_words": [
            "Men in Black 1997",
            "Men in Black",
            "1997",
            "MIB"
        ],
        "description": "Based off of the comic book. Unbeknownst to other people, there is a private agency code named MiB. This agency is some kind of extra terrestrial surveillance corporation. Then, one of the agency's finest men only going by the name 'K' (Tommy Lee Jones) , is recruiting for a new addition to the agency. He has chosen James Edwards (Will Smith) of the N.Y.P.D. Then, one day, a flying saucer crashes into Earth. This was an alien a part of the 'Bug' race. He takes the body of a farmer (Vincent D'Onofrio) and heads to New York. He is searching for a super energy source called 'The Galaxy'. Now, Agents J and K must stop the bug before it can escape with the galaxy."
    },
    {
        "title": "Blade",
        "poster": "https://image.tmdb.org/t/p/original/oWT70TvbsmQaqyphCZpsnQR7R32.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/hZnnUq0mrUQ3e54SJVca4mf2oAQ.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/bMhkCnATDPztcxFJULfnBqvzkyd.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/mOJ0ZFPzI2R4fku6HKZcuKA0RM0.png",
        "main_src": "https://vidsrc.in/embed/movie/36647",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/O2Y3FFFIvRI",
        "genre": [
            "Superhero",
            "Supernatural Horror",
            "Vampire Horror",
            "Action",
            "Horror",
            "Sci-Fi"
        ],
        "key_words": [
            "Blade 1998",
            "Blade",
            "1998"
        ],
        "description": "In a world where vampires walk the earth, Blade has a goal. His goal is to rid the world of all vampire evil. When Blade witnesses a vampire bite Dr. Karen Jenson, he fights away the beast and takes Jenson back to his hideout. Here, alongside Abraham Whistler, Blade attempts to help heal Jenson. The vampire Quinn who was attacked by Blade, reports back to his master Deacon Frost, who is planning a huge surprise for the human population."
    },
    {
        "title": "X-Men",
        "poster": "https://image.tmdb.org/t/p/original/bRDAc4GogyS9ci3ow7UnInOcriN.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/yGxMIIDSUvaXUjjJuIYZi40Jt3J.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/A9fpAjZLqsODM96aI6kx147LPM9.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/wYQkUdmS58hPP3Umm0XVtGoeUM6.png",
        "main_src": "https://vidsrc.in/embed/movie/36657",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/s4Wqw8tqgdM",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "X-Men",
            "X-Men 2000",
            "2000"
        ],
        "description": "In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Professor Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him."
    },
    {
        "title": "Blade II",
        "poster": "https://image.tmdb.org/t/p/original/azzTa03g0Fb8HC7O3521qq0oc8Q.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/ftVcl83v6RlH0yiK1Ubkw70VwIf.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/86b0NGY1i0bt3ckhkcHxiCSMxk1.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/vkUddkp0gNmrgPW8eInXKB0apjS.png",
        "main_src": "https://vidsrc.in/embed/movie/36586",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/fcCQ7xk8zzM",
        "genre": [
            "Martial Arts",
            "Superhero",
            "Supernatural Horror",
            "Vampire Horror",
            "Action",
            "Horror",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "Blade II 2002",
            "Blade 2 2002",
            "2002"
        ],
        "description": "A rare mutation has occurred within the vampire community. The Reaper. A vampire so consumed with an insatiable bloodlust that they prey on vampires as well as humans, transforming victims who are unlucky enough to survive into Reapers themselves. Now their quickly expanding population threatens the existence of vampires, and soon there won't be enough humans in the world to satisfy their bloodlust. Blade, Whistler and an armory expert named Scud are curiously summoned by the Shadow Council. The council reluctantly admits that they are in a dire situation and they require Blade's assistance. Blade then tenuously enters into an alliance with The Bloodpack, an elite team of vampires trained in all modes of combat to defeat the Reaper threat. Blade's team and the Bloodpack are the only line of defense which can prevent the Reaper population from wiping out the vampire and human populations."
    },
    {
        "title": "Spider-Man",
        "poster": "https://image.tmdb.org/t/p/original/gh4cZbhZxyTbgxQPxD0dOudNPTn.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/qJzloL8O9YHhiWBrhlPfKAtZu2I.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gkINAPOuwUFo2Qphs3OUUbjUKUZ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/kNPXwReF35JpWBqGw8HadykznPT.png",
        "main_src": "https://vidsrc.in/embed/movie/557",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/t06RUxPbp_c",
        "genre": [
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Spider-Man",
            "Spider-Man 2002",
            "2002"
        ],
        "description": "Based on Marvel Comics' superhero character, this is a story of Peter Parker who is a nerdy high-schooler. He was orphaned as a child, bullied by jocks, and can't confess his crush for his stunning neighborhood girl Mary Jane Watson. To say his life is 'miserable' is an understatement. But one day while on an excursion to a laboratory a runaway radioactive spider bites him... and his life changes in a way no one could have imagined. Peter acquires a muscle-bound physique, clear vision, ability to cling to surfaces and crawl over walls, shooting webs from his wrist ... but the fun isn't going to last. An eccentric millionaire Norman Osborn administers a performance enhancing drug on himself and his maniacal alter ego Green Goblin emerges. Now Peter Parker has to become Spider-Man and take Green Goblin to the task... or else Goblin will kill him. They come face to face and the war begins in which only one of them will survive at the end."
    },
    {
        "title": "Men in Black II",
        "poster": "https://image.tmdb.org/t/p/original/enA22EPyzc2WQ1VVyY7zxresQQr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/o1l6OCqA3pYDZHIc5L1s7CEzCMv.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gaObzSfuj8cLw2xpfphDVEs9aof.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/lRkTX0foJlLAUEYMdLrBKmmhn1R.png",
        "main_src": "https://vidsrc.in/embed/movie/608",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/DMHlNR6x2Sw",
        "genre": [
            "Buddy Comedy",
            "Buddy Cop",
            "Action",
            "Adventure",
            "Comedy",
            "Mystery",
            "Sci-Fi"
        ],
        "key_words": [
            "Men in Black 2 2002",
            "Men in Black II 2002",
            "Men in Black 2",
            "Men in Black II",
            "2002"
        ],
        "description": "Kay and Jay reunite to provide our best, last and only line of defense against a sinister seductress who levels the toughest challenge yet to the MIBs untarnished mission statement: protecting the earth from the scum of the universe. It's been four years since the alien-seeking agents averted an intergalactic disaster of epic proportions. And now it's a race against the clock as Jay must convince Kay-who not only has absolutely no memory of his time spent with the Men In Black, but is also the only living person left with the expertise to save the galaxy-to reunite with the MIB before the earth submits to ultimate destruction."
    },
    {
        "title": "Daredevil",
        "poster": "https://image.tmdb.org/t/p/original/oCDBwSkntYamuw8VJIxMRCtDBmi.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/e7jIX02GiSwsgkU5lMpeKjwq2Zc.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/rM9tazUDuzayuHVWkKpPYfuJkid.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/e3O89Ml6wykMdohlJ8nEpgBVYrF.png",
        "main_src": "https://vidsrc.in/embed/movie/9480",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/t3Xc6FjRfoA",
        "genre": [
            "Action Epic",
            "Gun Fu",
            "Martial Arts",
            "One-Person Army Action",
            "Serial Killer",
            "Superhero",
            "Action",
            "Crime",
            "Drama",
            "Sci-Fi"
        ],
        "key_words": [
            "Daredevil",
            "Daredevil 2003",
            "2003"
        ],
        "description": "Fate deals young orphan Matt Murdock a strange hand when he is doused with hazardous waste. The accident leaves Matt blind but also gives him a heightened 'radar sense' that allows him to 'see' far better than any man. Years later Murdock has grown into a man and becomes a respected criminal attorney. But after he's done his 'day job' Matt takes on a secret identity as 'The Man Without Fear,' Daredevil, the masked avenger that patrols the neighborhood of Hell's Kitchen and New York City to combat the injustice that he cannot tackle in the courtroom."
    },
    {
        "title": "X2: X-Men United",
        "poster": "https://image.tmdb.org/t/p/original/rtrd4qieMAhoUshu83Vi1GazM1O.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/s8ftvFvafWWEhApISamHx32bx6h.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/loixNIKBURXfPcND4noz7E8FqCS.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/Ab2M8vN5oaos3K7uE7B5vLmTzbJ.png",
        "main_src": "https://vidsrc.in/embed/movie/36658",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/yVzqz_zpP20",
        "genre": [
            "Superhero",
            "Action",
            "Sci-Fi",
            "Thriller"
        ],
        "key_words": [
            "X2: X-Men United 2003",
            "X2 X-Men United 2003",
            "X-Men 2 2003",
            "2003"
        ],
        "description": "Several months have passed since the X-Men defeated Magneto and imprisoned him in a seemingly impregnable plastic chamber. One day, a mutant by the name of Nightcrawler infiltrates the White House and attempts to assassinate the President, setting off a chain reaction of anti-mutant measures by the government. Meanwhile, Logan is trying to discover his past. As scientist named William Stryker discovers Professor X's secret school and Cerebro, Magneto's partner, Mystique, is planning to break her leader out of prison. But when Professor X's school is attacked by Stryker's forces, Logan, Rogue, Iceman, and a few are lucky to escape. Those who remain meet in Boston, where they form an uneasy alliance with Magneto to stop Stryker and rescue Professor X."
    },
    {
        "title": "Hulk",
        "poster": "https://image.tmdb.org/t/p/original/qnngKqAcqfH2pBxDoKu5lxzSbTo.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/kYd1ZMWvG9K2Jeop3XWXcTpJ2dB.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/gNjZ2R5B1JRSO8k8WCiE8DGReDO.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/bynaNzCI5szeRatWBbNQdMY5Lqm.png",
        "main_src": "https://vidsrc.in/embed/movie/1927",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/2ErnLuJKQA4",
        "genre": [
            "Kaiju",
            "One-Person Army Action",
            "Superhero",
            "Action",
            "Sci-Fi"
        ],
        "key_words": [
            "Hulk",
            "Hulk 2003",
            "2003"
        ],
        "description": "Bruce is an ordinary Gamma expert who one day gets blasted with radiation and somehow survives. But in the process a monster was born. Now whenever he gets angry he grows bigger and stronger until he is no longer Bruce Banner. He becomes The Hulk"
    },
    {
        "title": "The Punisher",
        "poster": "https://image.tmdb.org/t/p/original/7rmA1HwYp2GKM85BL0cVwCaosGr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/9j9qKlz9GvmSD3np6UEwWe6uSb.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/r8ylVdJwUxu9AnO2CzKzxfqx5hh.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/67jsep3Z7PAwnXeMTk8xzYDJNLy.png",
        "main_src": "https://vidsrc.in/embed/movie/7220",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/TqVSFchQEyM",
        "genre": [
            "One-Person Army Action",
            "Superhero",
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "key_words": [
            "The Punisher",
            "2004",
            "The Punisher 2004"
        ],
        "description": "Special agent Frank Castle had it all: A loving family, a great life, and an adventurous job. But when his life is taken away from him by a ruthless criminal and his associates, Frank has become reborn. Now serving as judge, jury, and executioner, he's a new kind of vigilante out to wage a one man war against those who have done him wrong."
    },
    {
        "title": "Spider-Man 2",
        "poster": "https://image.tmdb.org/t/p/original/olxpyq9kJAZ2NU1siLshhhXEPR7.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/8G6HCS82vNxgg5wp7oBDSk32XpF.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/8rpjbBVSmntipKriB27AoPsawMW.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/mSYIoj4eNWMDdxaTIf7xzDqvYDm.png",
        "main_src": "https://vidsrc.in/embed/movie/558",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/3jBFwltrxJw",
        "genre": [
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Spider-Man 2 2004",
            "Spider-Man II 2004",
            "2004"
        ],
        "description": "Peter Parker is an unhappy man: after two years of fighting crime as Spider-Man, his life has begun to fall apart. The girl he loves is engaged to someone else, his grades are slipping, he cannot keep any of his jobs, and on top of it, the newspaper Daily Bugle is attacking him viciously, claiming that Spider-Man is a criminal. He reaches the breaking point and gives up the crime fighter's life, once and for all. But after a failed fusion experiment, eccentric and obsessive scientist Dr. Otto Octavius is transformed into super villain Doctor Octopus, Doc Ock for short, having four long tentacles as extra hands. Peter guesses it might just be time for Spider-Man to return, but would he act upon it?"
    },
    {
        "title": "Blade: Trinity",
        "poster": "https://image.tmdb.org/t/p/original/r6ycjrStmmAqiY1oDjAli9NArCa.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/55885wQeb8XISRccwnfVJ7DDJFM.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/njDpl9B1BA9iX6TvKEZnca0omfQ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/sW4i8zzmZQ3tstiqOk0ASoberyp.png",
        "main_src": "https://vidsrc.in/embed/movie/36648",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/qcHEDGs7eAY",
        "genre": [
            "Superhero",
            "Vampire Horror",
            "Action",
            "Horror",
            "Sci-Fi"
        ],
        "key_words": [
            "Blade: Trinity 2004",
            "Blade Trinity 2004",
            "2004"
        ],
        "description": "Blade finds himself alone surrounded by enemies, fighting an up hill battle with the vampire nation and now humans. He joins forces with a group of vampire hunters who call themselves the Nightstalkers. The vampire nation awakens the king of vampires Dracula from his slumber with intentions of using his primitive blood to become day-walkers. On the other side is Blade and his team manifesting a virus that could wipe out the vampire race once and for all. In the end the two sides will collide and only one will come out victorious, a battle between the ultimate vampire who never knew defeat, facing off against the greatest vampire slayer."
    },
    {
        "title": "Elektra",
        "poster": "https://image.tmdb.org/t/p/original/9Azi1GBNj3gPPwmQWAMcATg7JOl.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/rLMQvYhl6DU6QZVNcJTbs87gVPs.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/tFK3pEREZQDA6cjAXwJEGvSseHQ.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/qAi6gUyInQK4RRPKLxpqJ5m5IpD.png",
        "main_src": "https://vidsrc.in/embed/movie/9947",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/etfIjKxKzqw",
        "genre": [
            "Gun Fu",
            "Superhero",
            "Action",
            "Adventure",
            "Crime",
            "Fantasy"
        ],
        "key_words": [
            "Elektra 2005",
            "2005"
        ],
        "description": "In the ultimate battle between good and evil stands a warrior who makes the choice that tips the balance. A strong, mysterious and a deadly sexy action heroine - a lethal synthesis of grace and power. Not long after recovering from seemingly mortal wounds, Elektra has severed all ties with the world, living only for her next assignment. But in an unexpected turn of events, she is forced to make a decision that can take her life in a new direction - or destroy her. Key players in Elektra's journey are Stick, a blind martial arts master responsible for Elektra's 'resurrection,' and Mark Miller and Abby Miller, a father and daughter on the run from The Hand, a powerful syndicate whose members practice the dark version of the martial art Kimagure."
    },
    {
        "title": "Fantastic Four",
        "poster": "https://image.tmdb.org/t/p/original/4YMcYEFS8sFuW3soP1HVmgR3cSm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/nDYz0HDfEiNVCBwhCDay8Ud0n7M.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/qxLi48XQuTkSzz28NCjwIbpkB21.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/mumBSCDUnc5kuy75dgKARu4fiOi.png",
        "main_src": "https://vidsrc.in/embed/movie/9738",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/QIx2jkXYu34",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Fantasy",
            "Sci-Fi"
        ],
        "key_words": [
            "Fantastic Four 2005",
            "2005"
        ],
        "description": "Four astronauts have their lives changed forever, when they end up being hit by a cloud of cosmic radiation. Reed Richards now has the ability to stretch his body like elastic. Sue Storm (Alba) is now the invisible woman. Johnny Storm becomes the human touch and Ben Grimm becomes the 'Thing', a man made out of rock. But there is one problem. The journey's sponsor, Victor Von Doom has also been affected and with full power, is a dangerous force which needs to be stopped, before it's too late."
    },
    {
        "title": "X-Men: The Last Stand",
        "poster": "https://image.tmdb.org/t/p/original/a2xicU8DpKtRizOHjQLC1JyCSRS.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/nYJ9hQe6F82bem3ufHAWBRyYm9m.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/jSKFzC4c3kWjlKo9Ou7D7NMn58C.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/gcTogee6TaQqJehZcronIY0ctYr.png",
        "main_src": "https://vidsrc.in/embed/movie/36668",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/X8ozc_dQprk",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "X-Men: The Last Stand 2006",
            "X-Men The Last Stand 2006",
            "X-Men: 3 2006",
            "X-Men 3 2006",
            "2006"
        ],
        "description": "When a 'cure' is created, which apparently can turn any mutant into a 'normal' human being, there is outrage amongst the mutant community. While some mutants do like the idea of a 'cure', including Rogue, many mutants find that there shouldn't be a 'cure'. Magneto, who still believes a war is coming, recruits a large team of mutants to take down Warren Worthington II and his 'cure'. Might seem easy for the X-Men to stop, but Magneto has a big advantage, which Wolverine doesn't have. Jean Grey has returned, and joined with Magneto. The Dark Phoenix has woken within her, which has the ability to destroy anything in her way, even if that 'anything' is an X-Man."
    },
    {
        "title": "Ghost Rider",
        "poster": "https://image.tmdb.org/t/p/original/d9Oan9XJJ6gRJa64Ifsgp1sXbC4.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/7zS58YPAw002RNejOF1vNB3XHbW.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/ohfWCHT65P7b3kQvZnoy2BL95MB.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/AsFDlONRL3fPH4w0DsjQ7rbtzh9.png",
        "main_src": "https://vidsrc.in/embed/movie/1250",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/nu6R7ypaz5g",
        "genre": [
            "Dark Fantasy",
            "Superhero",
            "Supernatural Fantasy",
            "Action",
            "Fantasy",
            "Thriller"
        ],
        "key_words": [
            "Ghost Rider 2007",
            "2007"
        ],
        "description": "When the motorcyclist Johnny Blaze finds that his father Barton Blaze has terminal cancer, he accepts a pact with Mephistopheles, giving his soul for the health of his beloved father. But the devil deceives him, and Barton dies in a motorcycle accident during an exhibition. Johnny leaves the carnival, his town, his friends, and his girlfriend Roxanne. Many years later, Johnny Blaze becomes a famous motorcyclist, who risks his life in his shows, and he meets Roxanne again, now a television reporter. However, Mephistopheles proposes Johnny to release his contract if he become the 'Ghost Rider' and defeat his evil son Blackheart, who wants to possess one thousand evil souls and transform hell on Earth."
    },
    {
        "title": "Spider-Man 3",
        "poster": "https://image.tmdb.org/t/p/original/sqZKCRYGovZ8aN99VVJSdL8Ja9k.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/eSGBbCOX7KM3Rf8HHwK8tglklyS.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/w1oD1MzHjnBJc5snKupIQaSBLIh.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/wPilOoeK96QNMiWI25Xugqu9yVf.png",
        "main_src": "https://vidsrc.in/embed/movie/559",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/wPosLpgMtTY",
        "genre": [
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Spider-Man 3 2007",
            "Spider-Man III 2007",
            "2007"
        ],
        "description": "Peter Parker has finally managed to piece together the once-broken parts of his life, maintaining a balance between his relationship with Mary-Jane and his responsibility as Spider-Man. But more challenges arise for our young hero. Peter's old friend Harry Obsourne has set out for revenge against Peter; taking up the mantle of his late father's persona as The New Goblin, and Peter must also capture Uncle Ben's real killer, Flint Marko, who has been transformed into his toughest foe yet, the Sandman. All hope seems lost when suddenly Peter's suit turns jet-black and greatly amplifies his powers. But it also begins to greatly amplify the much darker qualities of Peter's personality that he begins to lose himself to. Peter has to reach deep inside himself to free the compassionate hero he used to be if he is to ever conquer the darkness within and face not only his greatest enemies, but also...himself."
    },
    {
        "title": "Fantastic Four: Rise of the Silver Surfer",
        "poster": "https://image.tmdb.org/t/p/original/f3ldtPF7SESMcyAIyIJHBLlBBkr.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/pQDm7OkY7GAtDwGUcBEysHfMsNv.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/q7wzH2vkcJnVrmoLMCFyo7U3yz2.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/dgbnTqH4IzmhYZvnzyVS5BxHUWV.png",
        "main_src": "https://vidsrc.in/embed/movie/1979",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/Wiu5eZ_7vSY",
        "genre": [
            "Superhero",
            "Action",
            "Adventure",
            "Fantasy",
            "Sci-Fi"
        ],
        "key_words": [
            "Fantastic Four: Rise of the Silver Surfer 2007",
            "Fantastic Four Rise of the Silver Surfer 2007",
            "Fantastic Four 4: Rise of the Silver Surfer 2007",
            "Fantastic Four 4 2007",
            "2007"
        ],
        "description": "Everything seems to be going great for the Fantastic Four. Reed and Sue are finally getting married, and things couldn't seem better. However, when the mysterious Silver Surfer crashes things, they learn that they will have to deal with an old foe, and the powerful planet eating Galactus."
    },
    {
        "title": "Iron Man",
        "poster": "https://image.tmdb.org/t/p/original/78lPtwv72eTNqFW9COBYI0dWDJa.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/cyecB7godJ6kNHGONFjUyVN9OX5.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/cdsjxSR55VS80IiJfrQ9i9pWqrp.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/cnS4IgI51KwYUNyPz9HRmf4qhUh.png",
        "main_src": "https://vidsrc.in/embed/movie/1726",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/KAE5ymVLmZg",
        "genre": [
            "Sci-Fi Epic",
            "Superhero",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "Iron Man 2008",
            "2008"
        ],
        "description": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters."
    },
    {
        "title": "The Incredible Hulk",
        "poster": "https://image.tmdb.org/t/p/original/gKzYx79y0AQTL4UAk1cBQJ3nvrm.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/jPu8yiadqgzwFPGKJmGo637ASVP.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/oklXjbzJBYz5IGvibvLu59HX42K.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/l0UawWPTpB6uFolo7xqhQdloo8H.png",
        "main_src": "https://vidsrc.in/embed/movie/1724",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/dz6eBeW19Lg",
        "genre": [
            "Kaiju",
            "One-Person Army Action",
            "Superhero",
            "Urban Adventure",
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "key_words": [
            "The Incredible Hulk 2008",
            "2008"
        ],
        "description": "The story of Dr. Bruce Banner, who seeks a cure to his unique condition, which causes him to turn into a giant green monster under emotional stress, is depicted. Whilst on the run from military, which seeks his capture, Banner comes close to a cure. But he must contend with a new creature that emerges: The Abomination."
    },
    {
        "title": "Punisher: War Zone",
        "poster": "https://image.tmdb.org/t/p/original/oOvKJgYUIpfswGHAdW6159bPbvM.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/sPDIOvqyVzPo1Xu46BAB6aSGvSF.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/lx8SzVE62vZcPSvabdzWIMQijce.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/tP5PRhSS8PtjmTCleIcx6Esq9j9.png",
        "main_src": "https://vidsrc.in/embed/movie/13056",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/liABMxEvPAc",
        "genre": [
            "Superhero",
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "key_words": [
            "Punisher: War Zone 2008",
            "Punisher War Zone 2008",
            "Punisher 2: War Zone 2008",
            "Punisher 2 2008",
            "2008"
        ],
        "description": "Frank Castle, the ex-military man whose family was killed by criminals, who became a vigilante known as the Punisher, goes after a whole mob family and gets everyone except enforcer Billy Russoti. He tracks Russoti down and chases him into a vat that is used for crushing bottles. Frank turns on the crusher hoping it would take care of him but it doesn't. He survives but sustains very severe injuries that even with plastic surgery his face looks like a jigsaw puzzle. So he decides to adopt the name Jigsaw. Frank who killed one of Russoti's people who unknown to him is an undercover Fed, decides to pack it in. But when he learns Russoti didn't die and is looking for the money he entrusted to the Fed and will go looking for it at his home which means his family is in danger. So Frank tries to save them. But Russoti wants revenge on Frank so he breaks out his brother who is so crazed that he is committed to an asylum, to deal with him. And also another Fed who's a friend of the man Frank killed wants him too"
    },
    {
        "title": "X-Men Origins: Wolverine",
        "poster": "https://image.tmdb.org/t/p/original/yj8LbTju1p7CUJg7US2unSBk33s.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/wvqdJLVh0mSblly7UnYFPEk04Wd.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/kxDCq0RbHwVzVHUkxDi67Xilrrx.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/hqVryMGnnreF8uWF5NKdpPhOxBO.png",
        "main_src": "https://vidsrc.in/embed/movie/2080",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/PzyjvWiigxg",
        "genre": [
            "Superhero",
            "Action",
            "Sci-Fi"
        ],
        "key_words": [
            "X-Men Origins: Wolverine 2009",
            "X-Men Origins Wolverine 2009",
            "2009"
        ],
        "description": "Two mutant brothers, Logan and Victor, born 200 years ago, suffer childhood trauma and have only each other to depend upon. Basically, they're fighters and killers, living from war to war throughout U.S. history. In modern times, U.S. Colonel Stryker recruits them and other mutants as commandos. Logan quits and becomes a logger, falling in love with a local teacher. When Logan refuses to rejoin Stryker's crew, the Colonel sends the murderous Victor. Logan now wants revenge."
    },
    {
        "title": "Dragon",
        "poster": "https://image.tmdb.org/t/p/original/vKNJPuejtE6Xrp6RK6LKsQcbL8L.jpg",
        "backDropPoster": "https://image.tmdb.org/t/p/original/eie4xlRg5RZAbOklRVnmQoMew6M.jpg",
        "backDropPoster2": "https://image.tmdb.org/t/p/original/8y8pxJwYEK1WvQAfoZTwC601eD8.jpg",
        "logo_img": "https://image.tmdb.org/t/p/original/rvVDW5K1ndZYZVGkqNk20u6MwUc.png",
        "main_src": "https://Smoothpre.com/embed/k0bgk1ll1ibf",
        "own_src": "",
        "yt_trailer_src": "https://www.youtube.com/embed/qlBZlbJ7Nue",
        "genre": [
            "Comedy",
            "Drama",
            "Romance"
        ],
        "key_words": [
            "Dragon",
            "Dragon 2025",
            "2025"
        ],
        "description": "After a devastating breakup, troubled student Ragavan abandons his studies and enters the dangerous world of financial fraud, pursuing wealth and power while becoming entangled in escalating deception."
    }
]
